[
{
    "title": "Carry-On",
    "url": "https://www.rottentomatoes.com/m/carry_on",
    "review": "Die Hard karaoke this may be, but it delivers — and eclipses at least two of John McClane’s outings in the process. Look forward to future eye-rolling debates as to whether it qualifies as a Christmas movie.",
    "sentiment": "POSITIVE"
},
{
    "title": "Carry-On",
    "url": "https://www.rottentomatoes.com/m/carry_on",
    "review": "Egerton and Bateman’s performances elevate Carry-On and contribute significantly to the film’s overall success.",
    "sentiment": "POSITIVE"
},
{
    "title": "Carry-On",
    "url": "https://www.rottentomatoes.com/m/carry_on",
    "review": "There’s one big misstep, a car crash staged as a fixed shot through the windshield whose transparent digital fakery sticks out like a stuffed animal on a baggage carousel. But by and large it’s a no-frills affair, and delightfully so.",
    "sentiment": "POSITIVE"
},
{
    "title": "Carry-On",
    "url": "https://www.rottentomatoes.com/m/carry_on",
    "review": "Any idiot can make this sort of film, but considering how bad, not to mention boring, most of them are, it's no small feat to make one that is genuinely thrilling, genuinely suspenseful, and genuinely fun.",
    "sentiment": "POSITIVE"
},
{
    "title": "Carry-On",
    "url": "https://www.rottentomatoes.com/m/carry_on",
    "review": "Taron Egerton makes for a bloody good Bruce Willis, and Jaume Collet-Serra's film is a fun watch, too: it has a story that keeps itself moving, muscular action, and a smart, taut script whose characters we actually care about.",
    "sentiment": "POSITIVE"
},
{
    "title": "Carry-On",
    "url": "https://www.rottentomatoes.com/m/carry_on",
    "review": "Carry-On is never amazing, but it’s an easy watch that contains plenty of thrills and two very reliable performers at its center. And it teaches people to be nicer to TSA agents this holiday season.",
    "sentiment": "POSITIVE"
},
{
    "title": "65",
    "url": "https://www.rottentomatoes.com/m/65",
    "review": "The premise doesn't hold up to close scrutiny and the narrative can be jarringly slow-paced.",
    "sentiment": "NEGATIVE"
},
{
    "title": "65",
    "url": "https://www.rottentomatoes.com/m/65",
    "review": "65 is a gruesome thing to watch, even for dinosaur lovers—and not much fun, either.",
    "sentiment": "NEGATIVE"
},
{
    "title": "65",
    "url": "https://www.rottentomatoes.com/m/65",
    "review": "Driver gives a Driver-level performance and it’s a tight 90 minutes. And those two aspects alone are enough for a passable dino actioner.",
    "sentiment": "POSITIVE"
},
{
    "title": "65",
    "url": "https://www.rottentomatoes.com/m/65",
    "review": "Writers and directors Scott Beck and Bryan Woods put a lot on the film’s shoulders. They got butts in the theater with the sci fi action premise, but the heart of the film is a thin, trite indie drama about grief and finding a reason to continue to live.",
    "sentiment": "POSITIVE"
},
{
    "title": "65",
    "url": "https://www.rottentomatoes.com/m/65",
    "review": "It was the worst of times, it was the end of times. For the characters anyway. Not as bad I had heard, 65 is improved by the performances and also the constant pummelling that pre-historic Earth doles out to poor old Mills.",
    "sentiment": "POSITIVE"
},
{
    "title": "65",
    "url": "https://www.rottentomatoes.com/m/65",
    "review": "...a pared-down premise that’s employed to mostly compelling (and periodically spellbinding) effect...",
    "sentiment": "POSITIVE"
},
{
    "title": "Meet Me Next Christmas",
    "url": "https://www.rottentomatoes.com/m/meet_me_next_christmas",
    "review": "Their adventures play out with little charm, and the writing is often baffling, including the nonstop references to Pentatonix, who are also awkwardly featured in scenes throughout.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Meet Me Next Christmas",
    "url": "https://www.rottentomatoes.com/m/meet_me_next_christmas",
    "review": "It exists in Netflix festive movie world, an ever-expanding place of ever-diminishing returns, and while this won’t be a film someone would consider returning to next Christmas, it’ll just about do for now.",
    "sentiment": "POSITIVE"
},
{
    "title": "Meet Me Next Christmas",
    "url": "https://www.rottentomatoes.com/m/meet_me_next_christmas",
    "review": "Christina Milian and Devale Ellis are adorable. That’s the whole movie in a nutshell. Nothing else has to work in order to get what we need out of it. Pentatonix can’t even play themselves convincingly, at all, and it still doesn’t hurt this thing.",
    "sentiment": "POSITIVE"
},
{
    "title": "Meet Me Next Christmas",
    "url": "https://www.rottentomatoes.com/m/meet_me_next_christmas",
    "review": "Despite an awkward setup, when this quirky Christmas romance settles into the main act of its two lead characters' getting to know each other, it wins in tone and sweetness.",
    "sentiment": "POSITIVE"
},
{
    "title": "Meet Me Next Christmas",
    "url": "https://www.rottentomatoes.com/m/meet_me_next_christmas",
    "review": "Unfortunately, [Pentatonix] only has about ten minutes of screen time, and the rest of the film is a madcap adventure of a grown woman obsessively trying to get tickets for a Pentatonix show that’s, at best, silly, and at worst, absolute nonsense.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Meet Me Next Christmas",
    "url": "https://www.rottentomatoes.com/m/meet_me_next_christmas",
    "review": "Meet Me Next Christmas may not be a \"good\" movie in the traditional sense. But within its genre, where movies often feel interchangeable with each other, there's enough here to give this its own identity, and that's something worth praising.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Love Hard",
    "url": "https://www.rottentomatoes.com/m/love_hard",
    "review": "I was amused watching the writers try to twist this strange premise into a happy ending.",
    "sentiment": "POSITIVE"
},
{
    "title": "Love Hard",
    "url": "https://www.rottentomatoes.com/m/love_hard",
    "review": "American rom-coms have become a zombie genre, and brainless streaming content like Love Hard -- from its tech-driven narrative, nostalgic plotting, and tossed-off production -- epitomizes why they refuse to die or be reborn.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Love Hard",
    "url": "https://www.rottentomatoes.com/m/love_hard",
    "review": "Opposites attract, always and forever... and yet the screenwriters never bother to develop a plausible path for the destined couple to find its way to each other.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Love Hard",
    "url": "https://www.rottentomatoes.com/m/love_hard",
    "review": "Despite being an easy watch, the holiday film does leave one wondering if it takes a step too far in rationalising catfishing, and portraying the phenomenon as harmless.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Love Hard",
    "url": "https://www.rottentomatoes.com/m/love_hard",
    "review": "A light-hearted film with themes of lying makes it an interesting watch that leaves viewers confused about the overall message.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Love Hard",
    "url": "https://www.rottentomatoes.com/m/love_hard",
    "review": "Love Hard doesn’t try to be any of those movies, but the magic and chemistry between the romantic leads are just nowhere to be found.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Fifty Shades of Grey",
    "url": "https://www.rottentomatoes.com/m/fifty_shades_of_grey",
    "review": "I wish it had either been much better or much worse.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Fifty Shades of Grey",
    "url": "https://www.rottentomatoes.com/m/fifty_shades_of_grey",
    "review": "Fifty Shades of Grey delivers, however ponderously, on its promise of pop transgressiveness.",
    "sentiment": "POSITIVE"
},
{
    "title": "Fifty Shades of Grey",
    "url": "https://www.rottentomatoes.com/m/fifty_shades_of_grey",
    "review": "This alien quality is what makes Dornan so effective as Christian.",
    "sentiment": "POSITIVE"
},
{
    "title": "Fifty Shades of Grey",
    "url": "https://www.rottentomatoes.com/m/fifty_shades_of_grey",
    "review": "As dodgy, ludicrous and funny, as the film might be, as a public spectacle it’s probably not as embarrassing as being seen reading the book",
    "sentiment": "POSITIVE"
},
{
    "title": "Fifty Shades of Grey",
    "url": "https://www.rottentomatoes.com/m/fifty_shades_of_grey",
    "review": "Here's a film that is offensive only in how inoffensive it proves to be.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Fifty Shades of Grey",
    "url": "https://www.rottentomatoes.com/m/fifty_shades_of_grey",
    "review": "Feels like an elegantly made - the cinematography and score are top notch - night time soap opera.",
    "sentiment": "NEGATIVE"
},
{
    "title": "I Saw the TV Glow",
    "url": "https://www.rottentomatoes.com/m/i_saw_the_tv_glow",
    "review": "I Saw the TV Glow is a confident, original film, birthed and crafted in a way that feels wholly different to anything you’ve seen before – certainly not in mainstream Hollywood cinema.",
    "sentiment": "POSITIVE"
},
{
    "title": "I Saw the TV Glow",
    "url": "https://www.rottentomatoes.com/m/i_saw_the_tv_glow",
    "review": "The ending is the rawest and best part of this ­unconventional movie.",
    "sentiment": "POSITIVE"
},
{
    "title": "I Saw the TV Glow",
    "url": "https://www.rottentomatoes.com/m/i_saw_the_tv_glow",
    "review": "The power of I Saw the TV Glow lies precisely in its ambiguity, which may go deeper than was intended.",
    "sentiment": "POSITIVE"
},
{
    "title": "I Saw the TV Glow",
    "url": "https://www.rottentomatoes.com/m/i_saw_the_tv_glow",
    "review": "Schoenbrunn has crafted a deeply personal and somber exploration of identity, albeit one that might take more than a few viewings to fully grasp.",
    "sentiment": "POSITIVE"
},
{
    "title": "I Saw the TV Glow",
    "url": "https://www.rottentomatoes.com/m/i_saw_the_tv_glow",
    "review": "Jane Schoenbrun understands that with this sensation of finally, oh my god finally, feeling seen comes the lurking reckoning with the fact that it’s not real.",
    "sentiment": "POSITIVE"
},
{
    "title": "I Saw the TV Glow",
    "url": "https://www.rottentomatoes.com/m/i_saw_the_tv_glow",
    "review": "Schoenbrun provides multiple access points for audiences to latch onto (trans identity, music, 90s nostalgia), but it's stars Smith and Lundy-Paine who provide the devastating emotional wallop of a life lived unrealized",
    "sentiment": "POSITIVE"
},
{
    "title": "8-Bit Christmas",
    "url": "https://www.rottentomatoes.com/m/8_bit_christmas",
    "review": "June Diane Raphael has impeccable comic timing as Jake's mom, Kathy.",
    "sentiment": "POSITIVE"
},
{
    "title": "8-Bit Christmas",
    "url": "https://www.rottentomatoes.com/m/8_bit_christmas",
    "review": "8-Bit Christmas may have a more grounded approach to gamer culture than you'd expect, but it's constantly beat by its own limited imagination.",
    "sentiment": "NEGATIVE"
},
{
    "title": "8-Bit Christmas",
    "url": "https://www.rottentomatoes.com/m/8_bit_christmas",
    "review": "When it isn't fawning over roller rinks, \"Goonies\" posters, and Casio watches, \"8 Bit Christmas\" is a warm and refreshingly earnest holiday comedy.",
    "sentiment": "POSITIVE"
},
{
    "title": "8-Bit Christmas",
    "url": "https://www.rottentomatoes.com/m/8_bit_christmas",
    "review": "Watching 8-Bit Christmas is well worth your time. Packed full of comedy, and nostalgia, it’s got so much going for it.",
    "sentiment": "POSITIVE"
},
{
    "title": "8-Bit Christmas",
    "url": "https://www.rottentomatoes.com/m/8_bit_christmas",
    "review": "Very minor, but pleasant.",
    "sentiment": "POSITIVE"
},
{
    "title": "8-Bit Christmas",
    "url": "https://www.rottentomatoes.com/m/8_bit_christmas",
    "review": "At times it seems handcuffed by holiday movie expectations. But you kinda look over those baked-in tropes that are in nearly every movie like this. Instead, it’s the funny bits that end up standing out.",
    "sentiment": "POSITIVE"
},
{
    "title": "Furiosa: A Mad Max Saga",
    "url": "https://www.rottentomatoes.com/m/furiosa_a_mad_max_saga",
    "review": "George Miller re-visits his oil-soaked franchise with another brutal, female-dominated action film.",
    "sentiment": "POSITIVE"
},
{
    "title": "Furiosa: A Mad Max Saga",
    "url": "https://www.rottentomatoes.com/m/furiosa_a_mad_max_saga",
    "review": "“Furiosa” backs up, fills in the blanks and does a solid job of giving its title character a history that answers questions that its predecessor left in the dust.",
    "sentiment": "POSITIVE"
},
{
    "title": "Furiosa: A Mad Max Saga",
    "url": "https://www.rottentomatoes.com/m/furiosa_a_mad_max_saga",
    "review": "While it has you in its grip initially, it gradually loses its way amid marauding tribes, lynch mobs and innumerable chases through the sand dunes on souped-up vehicles. There are moments that take your breath away but don't add up to pack in a wallop.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Furiosa: A Mad Max Saga",
    "url": "https://www.rottentomatoes.com/m/furiosa_a_mad_max_saga",
    "review": "Miller's world-building is more interested in micro-aggressions that ultimately exhaust, and more importantly, do not land the claim Furiosa makes in the ultimate face-off with Dementus.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Furiosa: A Mad Max Saga",
    "url": "https://www.rottentomatoes.com/m/furiosa_a_mad_max_saga",
    "review": "The siege on a custom big rig is one of the most thrilling sequences I’ve ever seen in a movie.",
    "sentiment": "POSITIVE"
},
{
    "title": "Furiosa: A Mad Max Saga",
    "url": "https://www.rottentomatoes.com/m/furiosa_a_mad_max_saga",
    "review": "Furiosa: A Mad Max Saga is beautiful madness and pure cinematic bliss—epic storytelling packed with fiery mayhem and so much more.",
    "sentiment": "POSITIVE"
},
{
    "title": "Barbie",
    "url": "https://www.rottentomatoes.com/m/barbie",
    "review": "Greta Gerwig's film blazes its way into a strange and bold future where adapting a film from a corporate toy franchise doesn’t immediately feel ugly and anti-art.",
    "sentiment": "POSITIVE"
},
{
    "title": "Barbie",
    "url": "https://www.rottentomatoes.com/m/barbie",
    "review": "Beneath all the laughs at the expense of men and women is the sad truth that this brand of essentialism itself, of separating Barbies from Kens, of emphasizing their differences, is the thing that damages us the most.",
    "sentiment": "POSITIVE"
},
{
    "title": "Barbie",
    "url": "https://www.rottentomatoes.com/m/barbie",
    "review": "One of the best films of the year in cinematographic terms, probably the best comedy that we have seen in a long time, and an extraordinarily entertaining product that promotes the value of searching for a more cohesive society. [Full review in Spanish]",
    "sentiment": "POSITIVE"
},
{
    "title": "Barbie",
    "url": "https://www.rottentomatoes.com/m/barbie",
    "review": "With an overload of pink (not that we’re complaining), the film took over theatres globally with its timely and heartfelt messaging.",
    "sentiment": "POSITIVE"
},
{
    "title": "Barbie",
    "url": "https://www.rottentomatoes.com/m/barbie",
    "review": "The world’s most famous doll turns her thoughts to more existential, philosophical matters in Greta Gerwig’s Barbie, a jazzy and infectiously vibrant summer blockbuster.",
    "sentiment": "POSITIVE"
},
{
    "title": "Barbie",
    "url": "https://www.rottentomatoes.com/m/barbie",
    "review": "Gerwig and Baumbach offer thoughtful commentary not only on Barbie herself and everything she represents, but also on womanhood, feminism, and growing up.",
    "sentiment": "POSITIVE"
},
{
    "title": "Rare Exports: A Christmas Tale",
    "url": "https://www.rottentomatoes.com/m/rare_exports",
    "review": "[A] deliciously loopy oddball of a film.",
    "sentiment": "POSITIVE"
},
{
    "title": "Rare Exports: A Christmas Tale",
    "url": "https://www.rottentomatoes.com/m/rare_exports",
    "review": "The flaws of Rare Export offer an important reminder that looking good on YouTube does not provide qualifications for a bigger screen.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Rare Exports: A Christmas Tale",
    "url": "https://www.rottentomatoes.com/m/rare_exports",
    "review": "Rare Exports also twists the season's staples with a morbidly merry, tongue-in-cheek sense of humor.",
    "sentiment": "POSITIVE"
},
{
    "title": "Rare Exports: A Christmas Tale",
    "url": "https://www.rottentomatoes.com/m/rare_exports",
    "review": "Finds a creepy yet whimsical way to reinvent established holiday lore without sacrificing the expectations of audiences regarding its Christmas connections.",
    "sentiment": "POSITIVE"
},
{
    "title": "Rare Exports: A Christmas Tale",
    "url": "https://www.rottentomatoes.com/m/rare_exports",
    "review": "Although it has a lot of imagination, the lopsided outcome never balances its elements in a satisfying way.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Rare Exports: A Christmas Tale",
    "url": "https://www.rottentomatoes.com/m/rare_exports",
    "review": "From a slow and suspenseful start held by the charming Onni Tomilla as Pietari and Jomra Tomilla as his wiry, weathered and taciturn widower father, the brutal thrills ramp up deliciously.",
    "sentiment": "POSITIVE"
},
{
    "title": "Inside Out 2",
    "url": "https://www.rottentomatoes.com/m/inside_out_2",
    "review": "The turbulent tale of teenage emotions is moving, lovable and wildly creative.",
    "sentiment": "POSITIVE"
},
{
    "title": "Inside Out 2",
    "url": "https://www.rottentomatoes.com/m/inside_out_2",
    "review": "After a period of some ups and more downs, Pixar can at least boast of following up one of their later classics respectfully. Deserves the healthy audiences it will surely stir up.",
    "sentiment": "POSITIVE"
},
{
    "title": "Inside Out 2",
    "url": "https://www.rottentomatoes.com/m/inside_out_2",
    "review": "I found it a worthy sequel. Just about as clever, moving, and enjoyable as the original film.",
    "sentiment": "POSITIVE"
},
{
    "title": "Inside Out 2",
    "url": "https://www.rottentomatoes.com/m/inside_out_2",
    "review": "It's a fascinating shift of focus as a result. Where Riley needed her emotions to lead in Inside Out, her salvation in Inside Out 2 lies in stopping them from driving the car into a wall.",
    "sentiment": "POSITIVE"
},
{
    "title": "Inside Out 2",
    "url": "https://www.rottentomatoes.com/m/inside_out_2",
    "review": "Even with its flaws, it’s still one of the year’s most gorgeous and heartfelt films.",
    "sentiment": "POSITIVE"
},
{
    "title": "Inside Out 2",
    "url": "https://www.rottentomatoes.com/m/inside_out_2",
    "review": "Feels like a natural progression of the story established in the original movie.",
    "sentiment": "POSITIVE"
},
{
    "title": "Moana",
    "url": "https://www.rottentomatoes.com/m/moana_2016",
    "review": "Great fun. A traditional Disney Princess film but with a little more depth to it, being abut personal discovery and bravery.",
    "sentiment": "POSITIVE"
},
{
    "title": "Moana",
    "url": "https://www.rottentomatoes.com/m/moana_2016",
    "review": "... A great example of the studio putting a modern sheen on traditional formulas.",
    "sentiment": "POSITIVE"
},
{
    "title": "Moana",
    "url": "https://www.rottentomatoes.com/m/moana_2016",
    "review": "It's a deeply moving and beautiful film that celebrates it's main character, her culture and her self-empowerment... but she could have been a lot more meaningful and authentic if she reflected and honored a specific Pacific Island culture.",
    "sentiment": "POSITIVE"
},
{
    "title": "Moana",
    "url": "https://www.rottentomatoes.com/m/moana_2016",
    "review": "It manages to give us memorable musical numbers, charismatic characters and powerful images and builds a palpable and colourful world in which you want to stay. Full review in Spanish.",
    "sentiment": "POSITIVE"
},
{
    "title": "Moana",
    "url": "https://www.rottentomatoes.com/m/moana_2016",
    "review": "A very good bit of escapism with the top notch Disney music and important social themes about respect for nature.",
    "sentiment": "POSITIVE"
},
{
    "title": "Moana",
    "url": "https://www.rottentomatoes.com/m/moana_2016",
    "review": "Some great songs by Lin-Manuel Miranda...",
    "sentiment": "POSITIVE"
},
{
    "title": "1992",
    "url": "https://www.rottentomatoes.com/m/1992_2024",
    "review": "Better than I expected it to be, and some of the performances are quite good.",
    "sentiment": "POSITIVE"
},
{
    "title": "1992",
    "url": "https://www.rottentomatoes.com/m/1992_2024",
    "review": "As missed opportunities go, sadly this one hit me as being fairly massive.",
    "sentiment": "NEGATIVE"
},
{
    "title": "1992",
    "url": "https://www.rottentomatoes.com/m/1992_2024",
    "review": "Vromen and Penn would have been better off writing a straightforward father-son heist flick without trying (and failing) to pull off this high-concept maneuver.",
    "sentiment": "NEGATIVE"
},
{
    "title": "1992",
    "url": "https://www.rottentomatoes.com/m/1992_2024",
    "review": "While not revolutionary, 1992 offers a valuable commentary on the recent history of the United States and in the power of cinema to explore complex issues. [Full review in Spanish]",
    "sentiment": "POSITIVE"
},
{
    "title": "1992",
    "url": "https://www.rottentomatoes.com/m/1992_2024",
    "review": "1992 has similar elements of other heists films, but Tyrese Gibson career best performance elevates the film to another level.",
    "sentiment": "POSITIVE"
},
{
    "title": "1992",
    "url": "https://www.rottentomatoes.com/m/1992_2024",
    "review": "If you're going to take a historical event and make that the backdrop of the film, you better paint something worthy of the canvas... [But it's] just a run-of-the-mill heist movie.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Little Women",
    "url": "https://www.rottentomatoes.com/m/little_women_2019",
    "review": "A gorgeous and very warm film…. What makes this version impressive is that it brings a different perspective without losing the magic of the novel.",
    "sentiment": "POSITIVE"
},
{
    "title": "Little Women",
    "url": "https://www.rottentomatoes.com/m/little_women_2019",
    "review": "Greta Gerwig's experimental take adds clarity and wisdom to character developments and relationships that make the viewing experience more rewarding.",
    "sentiment": "POSITIVE"
},
{
    "title": "Little Women",
    "url": "https://www.rottentomatoes.com/m/little_women_2019",
    "review": "No wonder Jo and Amy in all their ambiguities are the ones who leave the strongest impression and offer Saoirse Ronan and Florence Pugh respectively the opportunity to invest in and dig into their characters with relish.",
    "sentiment": "POSITIVE"
},
{
    "title": "Little Women",
    "url": "https://www.rottentomatoes.com/m/little_women_2019",
    "review": "Every adaption of Little Women has something that sets it apart from others but few have the sheer emotion and power that we see here with Gerwig’s interpretation. Gerwig uncovers secret layers to the plot that lesser filmmakers would have not noticed",
    "sentiment": "POSITIVE"
},
{
    "title": "Little Women",
    "url": "https://www.rottentomatoes.com/m/little_women_2019",
    "review": "Gerwig’s Little Women has all the hallmarks of becoming a beloved Christmas movie, and one that can be enjoyed by not only for little women, but for little men too.",
    "sentiment": "POSITIVE"
},
{
    "title": "Little Women",
    "url": "https://www.rottentomatoes.com/m/little_women_2019",
    "review": "Gerwig does not condemn nor condone love and marriage; every character has their own viewpoints and opinions, and their respective struggles make this one of the most moving movie experiences of 2019.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Northman",
    "url": "https://www.rottentomatoes.com/m/the_northman",
    "review": "Not since Christopher Nolan’s Inception has a studio executive shown such balls of steel, or perhaps I should say boller av stal.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Northman",
    "url": "https://www.rottentomatoes.com/m/the_northman",
    "review": "Blood runs, mud flies and bones crack — in crisp, percussive ways you’ve hopefully never heard in real life — throughout The Northman, a grand, gut-spilling Norse epic that feels at once earthily ancient and thrillingly modern.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Northman",
    "url": "https://www.rottentomatoes.com/m/the_northman",
    "review": "A death-metal ode to honor, retribution and sacrifice that casts payback in a surprisingly, and thrillingly, positive light.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Northman",
    "url": "https://www.rottentomatoes.com/m/the_northman",
    "review": "Epic, brutally violent, nuanced, and dreamlike, The Northman is a showcase for a unique directorial voice worth celebrating.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Northman",
    "url": "https://www.rottentomatoes.com/m/the_northman",
    "review": "Neither tragedy nor Eggers skimp on violence, screams, sweat, blood and swords, along with ambitious mise en scène, some of the best photography and one of the most epic soundtracks of the year. [Full review in Spanish]",
    "sentiment": "POSITIVE"
},
{
    "title": "The Northman",
    "url": "https://www.rottentomatoes.com/m/the_northman",
    "review": "Filled with stunning cinematography, the film is an intense, immersive, sometimes surreal, descent into an otherworldly milieu of folkloric horror and medieval barbarism.",
    "sentiment": "POSITIVE"
},
{
    "title": "Bad Santa",
    "url": "https://www.rottentomatoes.com/m/bad_santa",
    "review": "Climactic uplift is far less important than the bawdy, nasty, inappropriate hilarity peddled by Terry Zwigoff’s 2003 gem, which also benefits from the participation of the late Bernie Mac and John Ritter.",
    "sentiment": "POSITIVE"
},
{
    "title": "Bad Santa",
    "url": "https://www.rottentomatoes.com/m/bad_santa",
    "review": "In the annals of movie profanity, this movie would rate an Oscar, but it's actually pretty sweet at heart, although never sentimental. And if you don't believe me, you know what you can do.",
    "sentiment": "POSITIVE"
},
{
    "title": "Bad Santa",
    "url": "https://www.rottentomatoes.com/m/bad_santa",
    "review": "An antidote to forced holiday cheer, this scabrously funny misanthropic comedy is not for the whole family.",
    "sentiment": "POSITIVE"
},
{
    "title": "Bad Santa",
    "url": "https://www.rottentomatoes.com/m/bad_santa",
    "review": "The film contains perhaps 90 seconds of genuine amusement. The rest is forced, juvenile, \"off.\"",
    "sentiment": "NEGATIVE"
},
{
    "title": "Bad Santa",
    "url": "https://www.rottentomatoes.com/m/bad_santa",
    "review": "His journey of humanization (or the softening of a terribly hardened heart) is sometimes genuinely poignant, even when it's surrounded by preposterously reprehensible conduct.",
    "sentiment": "POSITIVE"
},
{
    "title": "Bad Santa",
    "url": "https://www.rottentomatoes.com/m/bad_santa",
    "review": "Lauren Graham was wonderful as the sweet, at times horny, bartender with a thing for Santa.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Man Who Invented Christmas",
    "url": "https://www.rottentomatoes.com/m/the_man_who_invented_christmas",
    "review": "The Man Who Invented Christmas isn't a barnstormer but it's exactly the kind of holiday fare that will cure a bout of humbugness. Bring the family.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Man Who Invented Christmas",
    "url": "https://www.rottentomatoes.com/m/the_man_who_invented_christmas",
    "review": "A lightweight, tinselly film with some nice touches and appealing performances, though it never lands its darker moments.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Man Who Invented Christmas",
    "url": "https://www.rottentomatoes.com/m/the_man_who_invented_christmas",
    "review": "There are a few bright spots, like Christopher Plummer's Scrooge, but with its too-bright visuals and laboured dialogue, at best, the film belongs on television.",
    "sentiment": "NEGATIVE"
},
{
    "title": "The Man Who Invented Christmas",
    "url": "https://www.rottentomatoes.com/m/the_man_who_invented_christmas",
    "review": "A warm PG-rated feature for families with older kids who won't grow restless with its adult preoccupations and leisurely pace.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Man Who Invented Christmas",
    "url": "https://www.rottentomatoes.com/m/the_man_who_invented_christmas",
    "review": "The simplistic, unnecessarily slight film makes only insubstantial, passing references to poverty among children-a major issue then as it is today.",
    "sentiment": "NEGATIVE"
},
{
    "title": "The Man Who Invented Christmas",
    "url": "https://www.rottentomatoes.com/m/the_man_who_invented_christmas",
    "review": "A festive film, a movie for the holidays that reminds us of the spirit of the season. No \"Bah! Humbugs\" here.",
    "sentiment": "POSITIVE"
},
{
    "title": "Wolfs",
    "url": "https://www.rottentomatoes.com/m/wolfs",
    "review": "This is fairly entertaining -- Apple TV+ is the exact right place for it.",
    "sentiment": "POSITIVE"
},
{
    "title": "Wolfs",
    "url": "https://www.rottentomatoes.com/m/wolfs",
    "review": "Clooney and Pitt are such deft, charismatic actors that, even in a lazy, low-key picture like this one, you get a lot of pleasure from their barbed asides and mocking silences. It’s clear why they’ve been stars for three decades.",
    "sentiment": "POSITIVE"
},
{
    "title": "Wolfs",
    "url": "https://www.rottentomatoes.com/m/wolfs",
    "review": "It's a movie all about its star duo and they don't disappoint.",
    "sentiment": "POSITIVE"
},
{
    "title": "Wolfs",
    "url": "https://www.rottentomatoes.com/m/wolfs",
    "review": "Wolfs takes us on a whirlwind ride that is in no way groundbreaking but is wonderfully invigorating with a few cool twists thrown in. And the banter between Clooney and Pitt is clever, often hilarious, and sometimes poignant.",
    "sentiment": "POSITIVE"
},
{
    "title": "Wolfs",
    "url": "https://www.rottentomatoes.com/m/wolfs",
    "review": "Wolfs wants to be a Dad Movie but isn't kinetic or funny or violent enough to qualify. Speaking as a father myself, I'm not mad, just disappointed.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Wolfs",
    "url": "https://www.rottentomatoes.com/m/wolfs",
    "review": "Basic to the point of boring.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Jamie Foxx: What Had Happened Was...",
    "url": "https://www.rottentomatoes.com/m/jamie_foxx_what_had_happened_was",
    "review": "\"What Had Happened Was…\" isn’t so much a comedy special as a celebration of life. In its funniest moments... Foxx’s comic timing is so slick you forget he hasn’t done a stand-up set in two decades.",
    "sentiment": "POSITIVE"
},
{
    "title": "Jamie Foxx: What Had Happened Was...",
    "url": "https://www.rottentomatoes.com/m/jamie_foxx_what_had_happened_was",
    "review": "Overblown and religiose it may be, but this jaws-of-death account is heart-on-sleeve and hard to take your eyes off.",
    "sentiment": "POSITIVE"
},
{
    "title": "Jamie Foxx: What Had Happened Was...",
    "url": "https://www.rottentomatoes.com/m/jamie_foxx_what_had_happened_was",
    "review": "He’s here to tell his story and then draw a line under it, culminating with a celebration of his career highlights, as if giving himself a very public pep talk in front of a nurturing audience.",
    "sentiment": "POSITIVE"
},
{
    "title": "Jamie Foxx: What Had Happened Was...",
    "url": "https://www.rottentomatoes.com/m/jamie_foxx_what_had_happened_was",
    "review": "In his opening moments onstage, Foxx declares, “you have no idea how good this feels.” Sixty-eight minutes later, you’ll likely feel as good as he does.",
    "sentiment": "POSITIVE"
},
{
    "title": "Disney's A Christmas Carol",
    "url": "https://www.rottentomatoes.com/m/10008502-christmas_carol",
    "review": "While for some there is something disconcerting about the lifeless eyes of the otherwise life like characters, it certainly lends itself to large 3D cinemas, with rubber faced characters and grand sweeping movement.",
    "sentiment": "POSITIVE"
},
{
    "title": "Disney's A Christmas Carol",
    "url": "https://www.rottentomatoes.com/m/10008502-christmas_carol",
    "review": "The biggest surprise is that Zemeckis, so often in thrall to his digital palette, here uses it to freshly illuminate a time-honored text.",
    "sentiment": "POSITIVE"
},
{
    "title": "Disney's A Christmas Carol",
    "url": "https://www.rottentomatoes.com/m/10008502-christmas_carol",
    "review": "The greatest tension in this adaptation of A Christmas Carol isn't between Scrooge and those pesky ghosts but within writer-director Robert Zemeckis.",
    "sentiment": "POSITIVE"
},
{
    "title": "Disney's A Christmas Carol",
    "url": "https://www.rottentomatoes.com/m/10008502-christmas_carol",
    "review": "Everything poignant and evocative about Charles Dickens’s A Christmas Carol has been rendered flat by Disney’s latest adaptation.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Disney's A Christmas Carol",
    "url": "https://www.rottentomatoes.com/m/10008502-christmas_carol",
    "review": "Morbidly dark and frighteningly realistic - almost as if Tim Burton had a hand in the design.",
    "sentiment": "POSITIVE"
},
{
    "title": "Disney's A Christmas Carol",
    "url": "https://www.rottentomatoes.com/m/10008502-christmas_carol",
    "review": "Christmas magic never fails to touch the heart and spirit and neither will A CHRISTMAS CAROL. God Bless Us Everyone.",
    "sentiment": "POSITIVE"
},
{
    "title": "A Different Man",
    "url": "https://www.rottentomatoes.com/m/a_different_man",
    "review": "An audacious and mordantly funny attempt to analyse a subject that’s so often regarded as taboo.",
    "sentiment": "POSITIVE"
},
{
    "title": "A Different Man",
    "url": "https://www.rottentomatoes.com/m/a_different_man",
    "review": "It’s worth watching for Pearson’s performance. The karaoke scene — which seems almost mandatory in any comedy these days — is a highlight.",
    "sentiment": "POSITIVE"
},
{
    "title": "A Different Man",
    "url": "https://www.rottentomatoes.com/m/a_different_man",
    "review": "From the get-go, Aaron Schimberg is asking the right questions about prejudice and repulsion.",
    "sentiment": "POSITIVE"
},
{
    "title": "A Different Man",
    "url": "https://www.rottentomatoes.com/m/a_different_man",
    "review": "Aaron Schimberg presents a multi-faceted look at not only disability but identity at large, how these superficial alterations mean nothing when we don’t actualize change from within, and how much of our lives are rooted in perception",
    "sentiment": "POSITIVE"
},
{
    "title": "A Different Man",
    "url": "https://www.rottentomatoes.com/m/a_different_man",
    "review": "A Different Man proves a relevant commentary on our world's penchant to \"other\" those outside a given norm, but also an increasingly zany satire on our ability to \"other\" ourselves.",
    "sentiment": "POSITIVE"
},
{
    "title": "A Different Man",
    "url": "https://www.rottentomatoes.com/m/a_different_man",
    "review": "Confrontational, acidic and not at all complacent, A Different Man is a risky and refreshing exploration of hypocrisy. [Full review in Spanish]",
    "sentiment": "POSITIVE"
},
{
    "title": "Arthur Christmas",
    "url": "https://www.rottentomatoes.com/m/arthur_christmas",
    "review": "Parents may shed a nostalgic tear or two, while their children can enjoy spotting all the witty visual details.",
    "sentiment": "POSITIVE"
},
{
    "title": "Arthur Christmas",
    "url": "https://www.rottentomatoes.com/m/arthur_christmas",
    "review": "It's disarming, imaginative and genuinely funny.",
    "sentiment": "POSITIVE"
},
{
    "title": "Arthur Christmas",
    "url": "https://www.rottentomatoes.com/m/arthur_christmas",
    "review": "This witty, handsomely appointed 3-D animated feature is the most delightful Santa biopic since Edmund Gwenn donned the fat suit.",
    "sentiment": "POSITIVE"
},
{
    "title": "Arthur Christmas",
    "url": "https://www.rottentomatoes.com/m/arthur_christmas",
    "review": "Every clever, creative piece just keeps building on top of one another until you’ve got an infectiously sweet Christmas comedy and, even more surprisingly, a timelessly relevant look at adapting to and living with changing times.",
    "sentiment": "POSITIVE"
},
{
    "title": "Arthur Christmas",
    "url": "https://www.rottentomatoes.com/m/arthur_christmas",
    "review": "It softens your heart, makes you laugh, and provides a lighthearted time at the movies.",
    "sentiment": "POSITIVE"
},
{
    "title": "Arthur Christmas",
    "url": "https://www.rottentomatoes.com/m/arthur_christmas",
    "review": "A sweet and heart-warming tale, with some inventive animation and charming voice cast.",
    "sentiment": "POSITIVE"
},
{
    "title": "Horizon: An American Saga - Chapter 1",
    "url": "https://www.rottentomatoes.com/m/horizon_an_american_saga_chapter_1",
    "review": "Horizon is big and bold and majestic, with cinematographer J. Michael Muro capturing those expansive Utah vistas and John Debney’s score making sure that the film sounds just like the Westerns that play in the heads of everybody...",
    "sentiment": "POSITIVE"
},
{
    "title": "Horizon: An American Saga - Chapter 1",
    "url": "https://www.rottentomatoes.com/m/horizon_an_american_saga_chapter_1",
    "review": "There's nothing original about it... But I thought it was a serviceable Western.",
    "sentiment": "POSITIVE"
},
{
    "title": "Horizon: An American Saga - Chapter 1",
    "url": "https://www.rottentomatoes.com/m/horizon_an_american_saga_chapter_1",
    "review": "The three-hour epic is dull, frustrating and sleep-inducing.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Horizon: An American Saga - Chapter 1",
    "url": "https://www.rottentomatoes.com/m/horizon_an_american_saga_chapter_1",
    "review": "Costner is consistently deconstructing the myths of the American West, of manifest destiny and the idea that these people had a claim to anything. He shows us, and them, that this promised land of profit and glory never even existed at all.",
    "sentiment": "POSITIVE"
},
{
    "title": "Horizon: An American Saga - Chapter 1",
    "url": "https://www.rottentomatoes.com/m/horizon_an_american_saga_chapter_1",
    "review": "To be fair, it is difficult to judge the film since it is only 1/4 of the whole story.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Horizon: An American Saga - Chapter 1",
    "url": "https://www.rottentomatoes.com/m/horizon_an_american_saga_chapter_1",
    "review": "It's an above-average production, but we cannot conclude anything yet, as we have not seen the end. [Full review in Spanish]",
    "sentiment": "POSITIVE"
},
{
    "title": "The Guardians of the Galaxy Holiday Special",
    "url": "https://www.rottentomatoes.com/m/the_guardians_of_the_galaxy_holiday_special",
    "review": "As the exploitation of blockbuster power goes, it’s agreeably amusing.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Guardians of the Galaxy Holiday Special",
    "url": "https://www.rottentomatoes.com/m/the_guardians_of_the_galaxy_holiday_special",
    "review": "Adept at taking B-level comic book characters and turning them into franchise hits, Gunn does a lot with a little here with Marvel’s first-ever holiday special.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Guardians of the Galaxy Holiday Special",
    "url": "https://www.rottentomatoes.com/m/the_guardians_of_the_galaxy_holiday_special",
    "review": "A fluffy, funny holiday confection.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Guardians of the Galaxy Holiday Special",
    "url": "https://www.rottentomatoes.com/m/the_guardians_of_the_galaxy_holiday_special",
    "review": "This Christmas special is exactly what fans expected and more: a short, bittersweet, mostly sweet celebration with traditional Gunn humor. It perfectly captures the holiday spirit, while exploring family, friendship, generosity and selflessness.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Guardians of the Galaxy Holiday Special",
    "url": "https://www.rottentomatoes.com/m/the_guardians_of_the_galaxy_holiday_special",
    "review": "A stronger moral reckoning would have tied the knot on the sure-to-be instant holiday classic.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Guardians of the Galaxy Holiday Special",
    "url": "https://www.rottentomatoes.com/m/the_guardians_of_the_galaxy_holiday_special",
    "review": "A new Christmas Classic! \n\nMantis finally gets some time to shine",
    "sentiment": "POSITIVE"
},
{
    "title": "Four Christmases",
    "url": "https://www.rottentomatoes.com/m/four_christmases",
    "review": "",
    "sentiment": "NEGATIVE"
},
{
    "title": "Four Christmases",
    "url": "https://www.rottentomatoes.com/m/four_christmases",
    "review": "Projectile baby vomiting is a recurring gag. I cried mistletoe well before the film was halfway through.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Four Christmases",
    "url": "https://www.rottentomatoes.com/m/four_christmases",
    "review": "This is marginally better than most, with a few offbeat comic ideas, a reliably droll performance from Vaughn, and, as the parents, four watchable old troupers in search of a fat paycheck.",
    "sentiment": "POSITIVE"
},
{
    "title": "Four Christmases",
    "url": "https://www.rottentomatoes.com/m/four_christmases",
    "review": "Four Christmases represents the kind of passable holiday comedy that Hollywood serves up every year.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Four Christmases",
    "url": "https://www.rottentomatoes.com/m/four_christmases",
    "review": "Is this the worst Hollywood festive rom-com ever made?",
    "sentiment": "NEGATIVE"
},
{
    "title": "Four Christmases",
    "url": "https://www.rottentomatoes.com/m/four_christmases",
    "review": "Thanks to a satisfying performance by Witherspoon and Vaughn's dependable comic chops, Four Christmases is a modestly entertaining holiday film for the entire family.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Apprentice",
    "url": "https://www.rottentomatoes.com/m/the_apprentice",
    "review": "This very well-made movie is still constructed that are wholly and completely gossamer.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Apprentice",
    "url": "https://www.rottentomatoes.com/m/the_apprentice",
    "review": "It’s surprising and even a little disappointing that The Apprentice doesn’t go all in on the grotesque and extreme aspects of the Trumpian evolution. But it does show a side of the former US president that, you suspect, he would prefer not to be seen.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Apprentice",
    "url": "https://www.rottentomatoes.com/m/the_apprentice",
    "review": "The film is a well-paced and often entertaining story of how Trump evolved from an insecure blustery young man into a still insecure and blustery older one, but someone with a greater grasp of how to manipulate others and egomaniacally impose himself.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Apprentice",
    "url": "https://www.rottentomatoes.com/m/the_apprentice",
    "review": "The Apprentice won’t appeal to all and it doesn’t necessarily tell us anything we didn’t already know about Trump. It’s an engrossing character study of a man who took the opportunity to become the worst possible version of himself.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Apprentice",
    "url": "https://www.rottentomatoes.com/m/the_apprentice",
    "review": "Despite the fictionalized layer that exaggerates some facts, it's a biopic about Donald Trump that never fails to be entertaining when it delivers its plot about ambition, business and the corrupting power of the American dream. [Full review in Spanish]",
    "sentiment": "POSITIVE"
},
{
    "title": "The Apprentice",
    "url": "https://www.rottentomatoes.com/m/the_apprentice",
    "review": "With all the shoulder-padded glamour of Wall Street America, this is an origin story that doesn’t shy away from the darker sides of Trump's personality.",
    "sentiment": "POSITIVE"
},
{
    "title": "Piece By Piece",
    "url": "https://www.rottentomatoes.com/m/piece_by_piece_2024",
    "review": "The soundtrack is stuffed with hits but you’re not given the chance to settle into any of them. It’s also well stocked with platitudes and you are given plenty of time to mull over these. Too much time.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Piece By Piece",
    "url": "https://www.rottentomatoes.com/m/piece_by_piece_2024",
    "review": "Piece By Piece’s very existence is baffling, and the Lego of it all is never entirely justified, but as an unconventional documentary of a maverick musician, it works — just about.",
    "sentiment": "POSITIVE"
},
{
    "title": "Piece By Piece",
    "url": "https://www.rottentomatoes.com/m/piece_by_piece_2024",
    "review": "Take the plastic away and we’d also miss some insightful flights of invention: hot new beats glow from shelves like alien lifeforms. And celebrities in Lego form is a durable running joke.",
    "sentiment": "POSITIVE"
},
{
    "title": "Piece By Piece",
    "url": "https://www.rottentomatoes.com/m/piece_by_piece_2024",
    "review": "The film’s final act feels rushed, but Piece By Piece is endearing, playful filmmaking.",
    "sentiment": "POSITIVE"
},
{
    "title": "Piece By Piece",
    "url": "https://www.rottentomatoes.com/m/piece_by_piece_2024",
    "review": "The memoir is a clever fit of form and subject.",
    "sentiment": "POSITIVE"
},
{
    "title": "Piece By Piece",
    "url": "https://www.rottentomatoes.com/m/piece_by_piece_2024",
    "review": "Where Piece by Piece builds up to something truly different is how it uses its LEGO visuals to depict Williams compositionally connecting with a state of synaesthesia (where individual notes and complete melodies appear to him as colours).",
    "sentiment": "POSITIVE"
},
{
    "title": "28 Weeks Later",
    "url": "https://www.rottentomatoes.com/m/28_weeks_later",
    "review": "",
    "sentiment": "NEGATIVE"
},
{
    "title": "28 Weeks Later",
    "url": "https://www.rottentomatoes.com/m/28_weeks_later",
    "review": "",
    "sentiment": "POSITIVE"
},
{
    "title": "28 Weeks Later",
    "url": "https://www.rottentomatoes.com/m/28_weeks_later",
    "review": "",
    "sentiment": "POSITIVE"
},
{
    "title": "28 Weeks Later",
    "url": "https://www.rottentomatoes.com/m/28_weeks_later",
    "review": "Avoids treading familiar territory or attempts at replicating the first film's success, instead going bigger and bolder, though still never reaches the heights of the initial entry.",
    "sentiment": "POSITIVE"
},
{
    "title": "28 Weeks Later",
    "url": "https://www.rottentomatoes.com/m/28_weeks_later",
    "review": "The story moves at a frantic pace with tension and intensity playing bigger roles than genuine horror movie scares.",
    "sentiment": "POSITIVE"
},
{
    "title": "28 Weeks Later",
    "url": "https://www.rottentomatoes.com/m/28_weeks_later",
    "review": "The sequel's pandemic-facing conclusion has less faith in institutions than the original, making for a bleak, if urgent experience.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Muppet Christmas Carol",
    "url": "https://www.rottentomatoes.com/m/muppet_christmas_carol",
    "review": "Wonderful. The humour, the terrific soundtrack, it all just seems to come together in a way you wouldn't expect.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Muppet Christmas Carol",
    "url": "https://www.rottentomatoes.com/m/muppet_christmas_carol",
    "review": "Vastly enjoyable despite the syrupy, soppy song bit in the middle (go make a glass of mulled wine during it). Michael Caine is perfect in the role and there are many genuine belly laughs.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Muppet Christmas Carol",
    "url": "https://www.rottentomatoes.com/m/muppet_christmas_carol",
    "review": "The Muppets are at their best when they're anarchic, without all this soggy whimsy.",
    "sentiment": "NEGATIVE"
},
{
    "title": "The Muppet Christmas Carol",
    "url": "https://www.rottentomatoes.com/m/muppet_christmas_carol",
    "review": "The screenplay's wry humour and the mind-boggling ingenuity of the production team sell every moment.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Muppet Christmas Carol",
    "url": "https://www.rottentomatoes.com/m/muppet_christmas_carol",
    "review": "Every single scene is a delight and every song – including the stoical One More Sleep ’Til Christmas and joyful Thankful Heart – hits the perfect note.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Muppet Christmas Carol",
    "url": "https://www.rottentomatoes.com/m/muppet_christmas_carol",
    "review": "The real MVP is Caine and his cockney charm; he plays it entirely straight, acting his arse off alongside a slew of fuzzy, singing Muppets as he reminds us to hold each other close “with a thankful heart.”",
    "sentiment": "POSITIVE"
},
{
    "title": "The Little Mermaid",
    "url": "https://www.rottentomatoes.com/m/the_little_mermaid_2024",
    "review": "Scott throws in some H.P. Lovecraft to round out the public-domain plundering, but he neglects to include anything scary or disturbing.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Don't Move",
    "url": "https://www.rottentomatoes.com/m/dont_move_2024",
    "review": "If you want a taut guilty pleasure, this’ll do the trick.",
    "sentiment": "POSITIVE"
},
{
    "title": "Don't Move",
    "url": "https://www.rottentomatoes.com/m/dont_move_2024",
    "review": "Pacy thrills are doled out in a solid Sam Raimi-approved pulse-raiser with a few nifty ideas up its sleeve. Shall we try ‘Don’t Smell’ next?",
    "sentiment": "POSITIVE"
},
{
    "title": "Don't Move",
    "url": "https://www.rottentomatoes.com/m/dont_move_2024",
    "review": "Conspicuously subpar...",
    "sentiment": "NEGATIVE"
},
{
    "title": "Don't Move",
    "url": "https://www.rottentomatoes.com/m/dont_move_2024",
    "review": "Don’t Move lacks finesse but packs an emotional gut punch amid a largely fulfilled promising premise.",
    "sentiment": "POSITIVE"
},
{
    "title": "Don't Move",
    "url": "https://www.rottentomatoes.com/m/dont_move_2024",
    "review": "The movie is exactly what its title suggests, an inert thriller that doesn’t go anywhere tense or interesting, and you might even find yourself not moving because you’re fallen asleep from the boredom of it all.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Don't Move",
    "url": "https://www.rottentomatoes.com/m/dont_move_2024",
    "review": "Directors Brian Netto and Adam Schindler have some fun with the scenario and build the tension effectively, though the final showdown is a washout.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Family Man",
    "url": "https://www.rottentomatoes.com/m/family_man",
    "review": "Pleasant movie despite some predictability.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Family Man",
    "url": "https://www.rottentomatoes.com/m/family_man",
    "review": "It's rare that an American movie lets slip such a snobbish distaste for the humdrum lives of its blue-collar audience base, but of course it doesn't last.",
    "sentiment": "NEGATIVE"
},
{
    "title": "The Family Man",
    "url": "https://www.rottentomatoes.com/m/family_man",
    "review": "A holiday film Joe Lieberman could love, unembarrassed by its wholesome, sugary pro-family message.",
    "sentiment": "NEGATIVE"
},
{
    "title": "The Family Man",
    "url": "https://www.rottentomatoes.com/m/family_man",
    "review": "Makes you think about the different paths you could have taken in life. Sweet film",
    "sentiment": "POSITIVE"
},
{
    "title": "The Family Man",
    "url": "https://www.rottentomatoes.com/m/family_man",
    "review": "The Family Man's premise is simple yet heartfelt and beautiful, with an aching sense of solitude and profundity permeating the film.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Family Man",
    "url": "https://www.rottentomatoes.com/m/family_man",
    "review": "The Family Man proves it is indeed entirely possible to make a crowd-pleasing, highly commercial romantic movie with teeth which respects the audiences intelligence and doesn't spoon-feed them the same old predictable, recycled mish-mash.",
    "sentiment": "POSITIVE"
},
{
    "title": "Den of Thieves",
    "url": "https://www.rottentomatoes.com/m/den_of_thieves",
    "review": "Butler and Schreiber deliver commanding performances. They are men who could explode at any moment, at work or at home. That nonstop ticking beneath their calm exteriors fills the film with a gripping tension.",
    "sentiment": "POSITIVE"
},
{
    "title": "Den of Thieves",
    "url": "https://www.rottentomatoes.com/m/den_of_thieves",
    "review": "Den of Thieves desperately wants to be Heat or The Killer when it grows up. Instead it's a daft, distant, drunken cousin to those pictures, but if you studiously avoid thinking about it, you can at least enjoy its moronic antics.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Den of Thieves",
    "url": "https://www.rottentomatoes.com/m/den_of_thieves",
    "review": "The film's sole virtue is its finale - a complicated plot twist that sparks a belated, and brief, surge of interest.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Den of Thieves",
    "url": "https://www.rottentomatoes.com/m/den_of_thieves",
    "review": "It's one thing for the bad guys to shoot one another, but when cops place dozens of innocent people in the middle of an automatic gun battle it feels gratuitous even for a movie like this.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Den of Thieves",
    "url": "https://www.rottentomatoes.com/m/den_of_thieves",
    "review": "The lesson is simple, ladies and gents. Don't judge a book or movie by its cover. There could be a fun toy waiting in that gift you didn't care to unwrap.",
    "sentiment": "POSITIVE"
},
{
    "title": "Den of Thieves",
    "url": "https://www.rottentomatoes.com/m/den_of_thieves",
    "review": "The complete lack of likeable characters is a problem for a heist movie - in this struggle between violent criminals and corrupt cops, we don't particularly care who wins.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Terminator: Dark Fate",
    "url": "https://www.rottentomatoes.com/m/terminator_dark_fate",
    "review": "There's only so much even Hamilton and Davis can do with such one-note characters (though Hamilton, at least, seems like she's having a ton of fun), and Dark Fate doesn't seem especially interested in seeing them as anything more.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Terminator: Dark Fate",
    "url": "https://www.rottentomatoes.com/m/terminator_dark_fate",
    "review": "It's fine for two hours. But all the diversity window dressing can't hide Dark Fate's inconsequentiality.",
    "sentiment": "POSITIVE"
},
{
    "title": "Terminator: Dark Fate",
    "url": "https://www.rottentomatoes.com/m/terminator_dark_fate",
    "review": "This sixth installment puts the third, fourth and fifth to shame.",
    "sentiment": "POSITIVE"
},
{
    "title": "Terminator: Dark Fate",
    "url": "https://www.rottentomatoes.com/m/terminator_dark_fate",
    "review": "A spectacular misfire on all fronts.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Terminator: Dark Fate",
    "url": "https://www.rottentomatoes.com/m/terminator_dark_fate",
    "review": "Terminator: Dark Fate will not by any means blow you away but what it will do is rekindle some of that lost enthusiasm you had when you first watched The Terminator and Judgement Day.",
    "sentiment": "POSITIVE"
},
{
    "title": "Terminator: Dark Fate",
    "url": "https://www.rottentomatoes.com/m/terminator_dark_fate",
    "review": "Once again, as is customary in the saga, a dystopian future and games between temporal fluctuations are proposed through an anachronistic story, in which the new Terminator is more invincible than ever...",
    "sentiment": "NEGATIVE"
},
{
    "title": "The Fall Guy",
    "url": "https://www.rottentomatoes.com/m/the_fall_guy_2024",
    "review": "Charm is in short supply at the movies these days, but Gosling and Blunt give us every reason to believe in it.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Fall Guy",
    "url": "https://www.rottentomatoes.com/m/the_fall_guy_2024",
    "review": "I found the film to be exhaustingly loud and not terribly inspired.",
    "sentiment": "NEGATIVE"
},
{
    "title": "The Fall Guy",
    "url": "https://www.rottentomatoes.com/m/the_fall_guy_2024",
    "review": "Someone needed to supply a heftier story. A script that fleshed out the time in between all the mayhem.",
    "sentiment": "NEGATIVE"
},
{
    "title": "The Fall Guy",
    "url": "https://www.rottentomatoes.com/m/the_fall_guy_2024",
    "review": "It’s Gosling and Blunt who always keep it light on its feet. It’s flippant but absorbing too.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Fall Guy",
    "url": "https://www.rottentomatoes.com/m/the_fall_guy_2024",
    "review": "“The Fall Guy” is everything we needed it to be and nothing more. And that is what makes it the perfect summer blockbuster.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Fall Guy",
    "url": "https://www.rottentomatoes.com/m/the_fall_guy_2024",
    "review": "Now comes this latest underwhelming star vehicle, a missed opportunity that squanders a committed cast, inserts ludicrous product placement at just about every turn...",
    "sentiment": "NEGATIVE"
},
{
    "title": "The Christmas Chronicles",
    "url": "https://www.rottentomatoes.com/m/the_christmas_chronicles",
    "review": "In the end, the film succumbs to the tropes and emotional contrivances of the family melodrama at its core, ending up as a serviceable yet mostly forgettable addition to the already overstuffed genre of holiday-themed films.",
    "sentiment": "NEGATIVE"
},
{
    "title": "The Christmas Chronicles",
    "url": "https://www.rottentomatoes.com/m/the_christmas_chronicles",
    "review": "The film doesn't know how to get out of its own way and foreground what's working, namely the dynamo of screen presence placed more prominently in the advertising than the feature itself.",
    "sentiment": "NEGATIVE"
},
{
    "title": "The Christmas Chronicles",
    "url": "https://www.rottentomatoes.com/m/the_christmas_chronicles",
    "review": "The film's no great shakes, but Russell's star power in \"The Christmas Chronicles\" is a gift anyone should be happy to claim.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Christmas Chronicles",
    "url": "https://www.rottentomatoes.com/m/the_christmas_chronicles",
    "review": "With a plot as old as the jokes you find in a Christmas cracker... The Christmas Chronicles, would find itself firmly on the naughty list.",
    "sentiment": "NEGATIVE"
},
{
    "title": "The Christmas Chronicles",
    "url": "https://www.rottentomatoes.com/m/the_christmas_chronicles",
    "review": "Russell plays Santa with absolute integrity, which in this context means he plays Santa as Kurt Russell playing Santa, which is the only reason most people of legal age would want to watch this.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Christmas Chronicles",
    "url": "https://www.rottentomatoes.com/m/the_christmas_chronicles",
    "review": "A fun, spry holiday movie that should fit nicely onto your Christmastime watchlist.",
    "sentiment": "POSITIVE"
},
{
    "title": "An Almost Christmas Story",
    "url": "https://www.rottentomatoes.com/m/an_almost_christmas_story",
    "review": "This holiday special brings lots of cheer and a bit of melancholy, reflecting the mixed feelings of Christmas as one grows up.",
    "sentiment": "POSITIVE"
},
{
    "title": "An Almost Christmas Story",
    "url": "https://www.rottentomatoes.com/m/an_almost_christmas_story",
    "review": "An Almost Christmas Story is pure and simple and wholesome, and thoroughly delightful.",
    "sentiment": "POSITIVE"
},
{
    "title": "An Almost Christmas Story",
    "url": "https://www.rottentomatoes.com/m/an_almost_christmas_story",
    "review": "The animated proceedings are spiced with John C. Reilly voicing a street singer with a number of embraceable Christmas songs, & this Xmas TV Show length short film feels great for Christmas Eve, to give the family a dose of the Spirit. Who? David Lowery!",
    "sentiment": "POSITIVE"
},
{
    "title": "An Almost Christmas Story",
    "url": "https://www.rottentomatoes.com/m/an_almost_christmas_story",
    "review": "An Almost Christmas Story is, at its core, a charming and heartfelt holiday tale that, while not perfect, delivers on the essential qualities that make Christmas stories so endearing.",
    "sentiment": "POSITIVE"
},
{
    "title": "An Almost Christmas Story",
    "url": "https://www.rottentomatoes.com/m/an_almost_christmas_story",
    "review": "In the grand tradition of animated holiday shorts it's a sweet one",
    "sentiment": "POSITIVE"
},
{
    "title": "An Almost Christmas Story",
    "url": "https://www.rottentomatoes.com/m/an_almost_christmas_story",
    "review": "As a companion to Le Pupille and The Shepherd, An Almost Christmas Story is my favorite of the three and a shoo-in for consideration during the award season. It’s worth checking out even if you are not in the holiday spirit.",
    "sentiment": "POSITIVE"
},
{
    "title": "Dune: Part Two",
    "url": "https://www.rottentomatoes.com/m/dune_part_two",
    "review": "As a sequel, it works for the same reasons that make The Empire Strikes Back so many people’s favourite Star Wars film: there’s a darkness, a bleakness, that makes the fist-pumping moments feel all-the-more earned.",
    "sentiment": "POSITIVE"
},
{
    "title": "Dune: Part Two",
    "url": "https://www.rottentomatoes.com/m/dune_part_two",
    "review": "As different from the first film as [Ridley Scott's] Alien is to [James Cameron's] Aliens. Same stuff, totally different genre!",
    "sentiment": "POSITIVE"
},
{
    "title": "Dune: Part Two",
    "url": "https://www.rottentomatoes.com/m/dune_part_two",
    "review": "There is little character development and it’s not for the literal-minded -- or anyone who has, despite their best efforts, paid some attention.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Dune: Part Two",
    "url": "https://www.rottentomatoes.com/m/dune_part_two",
    "review": "Right from sound, camera work, and VFX to sharp and crisp editing, Dune 2 aces in every technical department.",
    "sentiment": "POSITIVE"
},
{
    "title": "Dune: Part Two",
    "url": "https://www.rottentomatoes.com/m/dune_part_two",
    "review": "Denis Villeneuve's sequel is a beautiful crash bang wallop of a film that is overpowering in its splendour and scale - a sci-fi film for people who don’t like sci-fi.",
    "sentiment": "POSITIVE"
},
{
    "title": "Dune: Part Two",
    "url": "https://www.rottentomatoes.com/m/dune_part_two",
    "review": "Bigger, bolder and more satisfying, <I>Dune: Part Two</I> triumphs over its predecessor.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Super Mario Bros. Movie",
    "url": "https://www.rottentomatoes.com/m/the_super_mario_bros_movie",
    "review": "Without overplaying its hand, it hits all the major notes within the wild, inventive universe of block-breaking and Goomba-stomping.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Super Mario Bros. Movie",
    "url": "https://www.rottentomatoes.com/m/the_super_mario_bros_movie",
    "review": "This lively computer-animated take on the video game just opened and it’s already the biggest box-office smash of 2023. Despite lapses into dull and disposable, it’s also a godsend for parents seeking family entertainment for the 5-year-old in all of us.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Super Mario Bros. Movie",
    "url": "https://www.rottentomatoes.com/m/the_super_mario_bros_movie",
    "review": "Among the many errors of The Super Mario Bros. Movie, screenwriter Matthew Fogel plops him and his brother Luigi into a milquetoast Brooklyn family that doubts them and disrespects their small-business dreams.",
    "sentiment": "NEGATIVE"
},
{
    "title": "The Super Mario Bros. Movie",
    "url": "https://www.rottentomatoes.com/m/the_super_mario_bros_movie",
    "review": "The iconic plumber’s big screen re-do is a proud celebration of the character’s appeal.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Super Mario Bros. Movie",
    "url": "https://www.rottentomatoes.com/m/the_super_mario_bros_movie",
    "review": "All movies exist to sell, but this exists to sell everything but the movie. It’s not a love letter – it’s soulless capitalism. The Super Mario Bros Movie is an imagination-free wasteland where cinematic storytelling goes to die.",
    "sentiment": "NEGATIVE"
},
{
    "title": "The Super Mario Bros. Movie",
    "url": "https://www.rottentomatoes.com/m/the_super_mario_bros_movie",
    "review": "A specific sequence set across the streets of Brooklyn is a gorgeous nod to the 2D platformer aesthetic. It might be my favorite adaptation of the gamified visual look to the big screen since “Tron: Legacy.”",
    "sentiment": "POSITIVE"
},
{
    "title": "Late Night with the Devil",
    "url": "https://www.rottentomatoes.com/m/late_night_with_the_devil",
    "review": "Assured in their craft, the Cairnes brothers deliver fulsome ratings satire and sharp scares.",
    "sentiment": "POSITIVE"
},
{
    "title": "Late Night with the Devil",
    "url": "https://www.rottentomatoes.com/m/late_night_with_the_devil",
    "review": "The cast makes Late Night With the Devil more than watchable, but they also raise our hopes for something better.",
    "sentiment": "POSITIVE"
},
{
    "title": "Late Night with the Devil",
    "url": "https://www.rottentomatoes.com/m/late_night_with_the_devil",
    "review": "The Cairnes cite Sidney Lumet’s Network as an influence and I’m not surprised. They have come up with a worthy successor.",
    "sentiment": "POSITIVE"
},
{
    "title": "Late Night with the Devil",
    "url": "https://www.rottentomatoes.com/m/late_night_with_the_devil",
    "review": "a thoroughly enjoyable horror that embraces the aesthetics and the dynamics of 1970s television.",
    "sentiment": "POSITIVE"
},
{
    "title": "Late Night with the Devil",
    "url": "https://www.rottentomatoes.com/m/late_night_with_the_devil",
    "review": "Aside from a couple of jump scares “Late Night…” didn’t particularly terrorize me. But I was absolutely mesmerized by the filmmakers’ recreation of a time and place.",
    "sentiment": "POSITIVE"
},
{
    "title": "Late Night with the Devil",
    "url": "https://www.rottentomatoes.com/m/late_night_with_the_devil",
    "review": "Like tuning into late night, Late Night with the Devil gives you pretty much exactly what you expect.",
    "sentiment": "POSITIVE"
},
{
    "title": "A Sudden Case of Christmas",
    "url": "https://www.rottentomatoes.com/m/a_sudden_case_of_christmas",
    "review": "Very boring and very dry",
    "sentiment": "NEGATIVE"
},
{
    "title": "A Sudden Case of Christmas",
    "url": "https://www.rottentomatoes.com/m/a_sudden_case_of_christmas",
    "review": "The tourist activities overpower the Christmas cheer, and while the Italian countryside looks gorgeous, the people inhabiting it are less compelling.",
    "sentiment": "NEGATIVE"
},
{
    "title": "A Sudden Case of Christmas",
    "url": "https://www.rottentomatoes.com/m/a_sudden_case_of_christmas",
    "review": "You could do a lot worse than this film and will likely have a happy group of family around the television if you put this on during the get-together this December.",
    "sentiment": "POSITIVE"
},
{
    "title": "A Sudden Case of Christmas",
    "url": "https://www.rottentomatoes.com/m/a_sudden_case_of_christmas",
    "review": "This is a surprisingly fun film in a sea of mid-tier Christmas movies.",
    "sentiment": "POSITIVE"
},
{
    "title": "A Sudden Case of Christmas",
    "url": "https://www.rottentomatoes.com/m/a_sudden_case_of_christmas",
    "review": "This flimsy Christmas cliché should mark the end of Michael Bublé needle drops.",
    "sentiment": "NEGATIVE"
},
{
    "title": "A Sudden Case of Christmas",
    "url": "https://www.rottentomatoes.com/m/a_sudden_case_of_christmas",
    "review": "A Sudden Case of Christmas, starring Danny DeVito, turns the traditional family Christmas movie upside down for a fun and quirky ride.",
    "sentiment": "POSITIVE"
},
{
    "title": "A Christmas Story",
    "url": "https://www.rottentomatoes.com/m/1004151-christmas_story",
    "review": "It's all in A Christmas Story, but it's as real as wax fruit.",
    "sentiment": "NEGATIVE"
},
{
    "title": "A Christmas Story",
    "url": "https://www.rottentomatoes.com/m/1004151-christmas_story",
    "review": "The film does its commercial best to dole out the requisite nostalgia without being too sticky. The result is a pleasant, undistinguished Christmas pudding spiced with humor and enriched by some good performances from the kids.",
    "sentiment": "POSITIVE"
},
{
    "title": "A Christmas Story",
    "url": "https://www.rottentomatoes.com/m/1004151-christmas_story",
    "review": "It's a nostalgic comedy featuring a family of eccentrics who lovingly celebrate the holidays and life itself in Midwestern America in the 1940s.",
    "sentiment": "POSITIVE"
},
{
    "title": "A Christmas Story",
    "url": "https://www.rottentomatoes.com/m/1004151-christmas_story",
    "review": "Bob Clark’s little Christmas movie “A Christmas Story” has vaulted into full Christmas Classic status.",
    "sentiment": "POSITIVE"
},
{
    "title": "A Christmas Story",
    "url": "https://www.rottentomatoes.com/m/1004151-christmas_story",
    "review": "For old timers like myself, the final scene of Ralphie sleeping with his Christmas prize will always hold true to me and brings back yearly memories of one of the easiest times of anyones life, their childhood.",
    "sentiment": "POSITIVE"
},
{
    "title": "A Christmas Story",
    "url": "https://www.rottentomatoes.com/m/1004151-christmas_story",
    "review": "An uproarious adaptation of Jean Shepherd’s book In God We Trust, All Others Pay Cash.",
    "sentiment": "POSITIVE"
},
{
    "title": "Meet Me in St. Louis",
    "url": "https://www.rottentomatoes.com/m/meet_me_in_st_louis",
    "review": "If you were born and brought up in St. Louis, and aware from earliest childhood of The Fair... then the picture will seem even more like watching the youth of your parents and aunts and uncles, and it is all just as they told you.",
    "sentiment": "POSITIVE"
},
{
    "title": "Meet Me in St. Louis",
    "url": "https://www.rottentomatoes.com/m/meet_me_in_st_louis",
    "review": "Practically every member of the family from the 5-year-olds to grandma will find entertainment and fun.",
    "sentiment": "POSITIVE"
},
{
    "title": "Meet Me in St. Louis",
    "url": "https://www.rottentomatoes.com/m/meet_me_in_st_louis",
    "review": "Altogether the picture will give you an exhilarated feeling and a sense of well being plus an appreciation for this bright bit of Americana.",
    "sentiment": "POSITIVE"
},
{
    "title": "Meet Me in St. Louis",
    "url": "https://www.rottentomatoes.com/m/meet_me_in_st_louis",
    "review": "Vincent Minelli’s first Technicolor film is the ultimate in Hollywood Americana and a masterful musical that turned Judy Garland into a true leading lady.",
    "sentiment": "POSITIVE"
},
{
    "title": "Meet Me in St. Louis",
    "url": "https://www.rottentomatoes.com/m/meet_me_in_st_louis",
    "review": "Vincente Minnelli has been sensible about directing Meet Me in St. Louis. He didn't go out of his way to spill tears, or even try hard for laughs -- he just let things take their course.",
    "sentiment": "POSITIVE"
},
{
    "title": "Meet Me in St. Louis",
    "url": "https://www.rottentomatoes.com/m/meet_me_in_st_louis",
    "review": "It’s a picture that will bring tears to your eyes, but send you away proud of them. It’s also a picture whose principal appeal hinges on a store of wonderful youthful memories which you probably thought you had forgotten.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Batman",
    "url": "https://www.rottentomatoes.com/m/the_batman",
    "review": "The film creates an alluring combination of the familiar and the fresh.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Batman",
    "url": "https://www.rottentomatoes.com/m/the_batman",
    "review": "“The Batman” reaches for an ingenious and compelling new way to tell a story about the thin lines between corruption, greed and nobility — but ever so limply and always just out of its grasp.",
    "sentiment": "NEGATIVE"
},
{
    "title": "The Batman",
    "url": "https://www.rottentomatoes.com/m/the_batman",
    "review": "The film I imagine Ricky Fitts would grow up to make after the events of 'American Beauty.'",
    "sentiment": "NEGATIVE"
},
{
    "title": "The Batman",
    "url": "https://www.rottentomatoes.com/m/the_batman",
    "review": "\"The Batman\" has a somber tone different from previous versions that, due to its enunciation, bring it closer to the style of the Film-Noir film genre, returning to the original style of the comic strip and its proximity to pulp literature.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Batman",
    "url": "https://www.rottentomatoes.com/m/the_batman",
    "review": "When it’s all said and done, The Batman is good—not great. From technical and narrative standpoints, there are both gaps and achievements.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Batman",
    "url": "https://www.rottentomatoes.com/m/the_batman",
    "review": "For a film set deep in the depths of Gotham’s gritty underbelly, the script slowly descends into the chaotic silliness of the characters that it feels so desperate to shed",
    "sentiment": "NEGATIVE"
},
{
    "title": "Oddity",
    "url": "https://www.rottentomatoes.com/m/oddity",
    "review": "While the story of Oddity is a fascinating one, it is less the tale itself than the particular way McCarthy chooses to tell it that renders it one of the year’s best horror movies",
    "sentiment": "POSITIVE"
},
{
    "title": "Oddity",
    "url": "https://www.rottentomatoes.com/m/oddity",
    "review": "Irish director Damian Mc Carthy shows great skill in creating uncanny atmosphere with an elegantly constructed tale that combines supernatural chills and violent revenge in the EC Comics tradition.",
    "sentiment": "POSITIVE"
},
{
    "title": "Oddity",
    "url": "https://www.rottentomatoes.com/m/oddity",
    "review": "This \"Oddity\" hides mysteries that are worth delving into. [Full review in Spanish]",
    "sentiment": "POSITIVE"
},
{
    "title": "Oddity",
    "url": "https://www.rottentomatoes.com/m/oddity",
    "review": "When the film is good it can be exceptional, showing off strong technique and inventive ideas. For the most part, however, it is hobbled by more than its fair share of creative problems – not to mention a key ethical one.",
    "sentiment": "POSITIVE"
},
{
    "title": "Oddity",
    "url": "https://www.rottentomatoes.com/m/oddity",
    "review": "Oddity infuses originality into the classic gothic horror structure, but it shines the brightest in its masterfully crafted home invasion scenes, which contain some of the most suspenseful movie moments of the year.",
    "sentiment": "POSITIVE"
},
{
    "title": "Oddity",
    "url": "https://www.rottentomatoes.com/m/oddity",
    "review": "Oddity turns out to be a pleasing, lean, mean supernatural horror which makes all of its artefacts and ideas count, and you find yourself rooting for all of its moments of bloody comeuppance.",
    "sentiment": "POSITIVE"
},
{
    "title": "It's a Wonderful Life",
    "url": "https://www.rottentomatoes.com/m/its_a_wonderful_life",
    "review": "A movie people will have a good time watching with their families for enduring decades.",
    "sentiment": "POSITIVE"
},
{
    "title": "It's a Wonderful Life",
    "url": "https://www.rottentomatoes.com/m/its_a_wonderful_life",
    "review": "There's sex and death here, elation and depression, hope and despair.",
    "sentiment": "POSITIVE"
},
{
    "title": "It's a Wonderful Life",
    "url": "https://www.rottentomatoes.com/m/its_a_wonderful_life",
    "review": "While it isn't the best picture to come out of Hollywood this year, nor is it Capra's masterpiece, it tells a good story and its conclusion has a heart-warming effect on the audience.",
    "sentiment": "POSITIVE"
},
{
    "title": "It's a Wonderful Life",
    "url": "https://www.rottentomatoes.com/m/its_a_wonderful_life",
    "review": "Frank Capra's classic is a perfect movie, and almost 80 years on, Jimmy Stewart's masterpiece has lost absolutely none of its magic.",
    "sentiment": "POSITIVE"
},
{
    "title": "It's a Wonderful Life",
    "url": "https://www.rottentomatoes.com/m/its_a_wonderful_life",
    "review": "\"an enduring classic... timeless\"",
    "sentiment": "POSITIVE"
},
{
    "title": "It's a Wonderful Life",
    "url": "https://www.rottentomatoes.com/m/its_a_wonderful_life",
    "review": "...earned their climactic waterfall of happy tears...",
    "sentiment": "POSITIVE"
},
{
    "title": "Here",
    "url": "https://www.rottentomatoes.com/m/here_2024",
    "review": "Here, adapted by Zemeckis with Eric Roth from Richard McGuire’s acclaimed 2014 graphic novel, is as flavorless and fungible as a freshly packaged loaf of Wonder Bread.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Here",
    "url": "https://www.rottentomatoes.com/m/here_2024",
    "review": "'Here' is a soulless, meandering bore, proving that nostalgia and tech tricks can’t save a story with nowhere to go.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Here",
    "url": "https://www.rottentomatoes.com/m/here_2024",
    "review": "While Hanks and Wright pull off the impossible, emoting somewhat effectively despite the overuse of de-aging technology, it wasn't enough to save this film from feeling gimmicky instead of genuine.",
    "sentiment": "POSITIVE"
},
{
    "title": "Here",
    "url": "https://www.rottentomatoes.com/m/here_2024",
    "review": "The reflections on the passage of time and the complexity of life are appreciated, but the depth sought by its creators is never achieved. [Full review in Spanish]",
    "sentiment": "NEGATIVE"
},
{
    "title": "Here",
    "url": "https://www.rottentomatoes.com/m/here_2024",
    "review": "In this millennia-spanning tapestry, we see these universal ideas that encompass life for everyone: love, loss, aspirations, regret, connection, and separation.",
    "sentiment": "POSITIVE"
},
{
    "title": "Here",
    "url": "https://www.rottentomatoes.com/m/here_2024",
    "review": "A monumental success that will stand the test of time.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Family Stone",
    "url": "https://www.rottentomatoes.com/m/family_stone",
    "review": "The Family Stone works hard to warm the cockles of our hearts. The cast is attractive. The sentiments are commendable. But the love Bezucha wants us to feel for the family couldn't possibly compete with the love they already feel for themselves.",
    "sentiment": "NEGATIVE"
},
{
    "title": "The Family Stone",
    "url": "https://www.rottentomatoes.com/m/family_stone",
    "review": "",
    "sentiment": "POSITIVE"
},
{
    "title": "The Family Stone",
    "url": "https://www.rottentomatoes.com/m/family_stone",
    "review": "I can't deny the incidental pleasures of watching these talented players giving it their all, even in such a misguided project.",
    "sentiment": "NEGATIVE"
},
{
    "title": "The Family Stone",
    "url": "https://www.rottentomatoes.com/m/family_stone",
    "review": "I just can't stand this group and the ending is unbelievable",
    "sentiment": "NEGATIVE"
},
{
    "title": "The Family Stone",
    "url": "https://www.rottentomatoes.com/m/family_stone",
    "review": "By the end of the film...I always find myself tearing up.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Family Stone",
    "url": "https://www.rottentomatoes.com/m/family_stone",
    "review": "The Family Stone flips the script by having Thad be loved and supported by all his siblings and both his parents. Nothing can compete with Diane Lane, as Thad’s mom...",
    "sentiment": "POSITIVE"
},
{
    "title": "Last Christmas",
    "url": "https://www.rottentomatoes.com/m/last_christmas_2019",
    "review": "[It's] a star-studded romcom that plays like an expensive Hallmark film.",
    "sentiment": "POSITIVE"
},
{
    "title": "Last Christmas",
    "url": "https://www.rottentomatoes.com/m/last_christmas_2019",
    "review": "Still, it's worth a visit to the multiplex to behold cinematographer John Schwartzman (National Treasure: Book of Secrets, The Founder) accept the challenge of illuminating a feature almost entirely by Christmas lights.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Last Christmas",
    "url": "https://www.rottentomatoes.com/m/last_christmas_2019",
    "review": "Last Christmas is patronising, illogical and silly.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Last Christmas",
    "url": "https://www.rottentomatoes.com/m/last_christmas_2019",
    "review": "The script isn’t Thompson’s best.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Last Christmas",
    "url": "https://www.rottentomatoes.com/m/last_christmas_2019",
    "review": "Though Last Christmas sticks to some of the genre's prior tropes, it outdoes the norm through a multitude of layers and credible performances that are genuine and scarce in the usual holiday films produced.",
    "sentiment": "POSITIVE"
},
{
    "title": "Last Christmas",
    "url": "https://www.rottentomatoes.com/m/last_christmas_2019",
    "review": "A painfully stereotypical rom-com that fails to touch any chords.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Elevation",
    "url": "https://www.rottentomatoes.com/m/elevation",
    "review": "Everyone is solid in this and you see a lot of lovely aerial shots of the Rocky Mountains.",
    "sentiment": "POSITIVE"
},
{
    "title": "Elevation",
    "url": "https://www.rottentomatoes.com/m/elevation",
    "review": "It’s odd and impersonal, and produces a film that feels just as detached from its visual style as it does from its characters.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Elevation",
    "url": "https://www.rottentomatoes.com/m/elevation",
    "review": "There are exactly enough thrills to fill a 90-minute movie, including the closing credits. No more and no less. So thank god Elevation is short or it probably would have stunk.",
    "sentiment": "POSITIVE"
},
{
    "title": "Elevation",
    "url": "https://www.rottentomatoes.com/m/elevation",
    "review": "Perhaps the movie would've been less painful if it had a sense of humor about itself. [Full review in Spanish]",
    "sentiment": "NEGATIVE"
},
{
    "title": "Elevation",
    "url": "https://www.rottentomatoes.com/m/elevation",
    "review": "The creatures look good, the cast anchors it well, and there’s clearly much more to the world than we see in this iteration… The biggest weakness is that it reads far too bluntly like so many films that have gone before.",
    "sentiment": "POSITIVE"
},
{
    "title": "Elevation",
    "url": "https://www.rottentomatoes.com/m/elevation",
    "review": "A briskly paced post-apocalyptic action thriller.",
    "sentiment": "POSITIVE"
},
{
    "title": "Strange Darling",
    "url": "https://www.rottentomatoes.com/m/strange_darling",
    "review": "There is a beauteously ruthless toxicity to Mollner’s cruel world that’s honestly glorious, and for those that get on his wavelength, Strange Darling is a great deal of malicious fun.",
    "sentiment": "POSITIVE"
},
{
    "title": "Strange Darling",
    "url": "https://www.rottentomatoes.com/m/strange_darling",
    "review": "Do you enjoy walking out of a cinema and wondering what the hell you just watched? Then, oh boy, has JT Mollner got a movie for you.",
    "sentiment": "POSITIVE"
},
{
    "title": "Strange Darling",
    "url": "https://www.rottentomatoes.com/m/strange_darling",
    "review": "... An ingenious B-grade thriller with A-grade commitment.",
    "sentiment": "POSITIVE"
},
{
    "title": "Strange Darling",
    "url": "https://www.rottentomatoes.com/m/strange_darling",
    "review": "This was such a surprise and absolute cinematic delight.",
    "sentiment": "POSITIVE"
},
{
    "title": "Strange Darling",
    "url": "https://www.rottentomatoes.com/m/strange_darling",
    "review": "This is the kind of fantastic filmmaking where you need to simply allow the non-linear narrative to unfold and strap in for the ride. Spoilers would spoil. Suffice to say, both Willa Fitzgerald and Kyle Gallner are smashing in their captivating roles.",
    "sentiment": "POSITIVE"
},
{
    "title": "Strange Darling",
    "url": "https://www.rottentomatoes.com/m/strange_darling",
    "review": "Part of Strange Darling’s charm is how many times it can fool you into thinking you know what’s going on, just to pull the rug from underneath you.",
    "sentiment": "POSITIVE"
},
{
    "title": "Better Watch Out",
    "url": "https://www.rottentomatoes.com/m/better_watch_out",
    "review": "... Better Watch Out is a delightfully nasty seasonal inversion, replete with carollers, decorations, themed jumpers and booze.",
    "sentiment": "POSITIVE"
},
{
    "title": "Better Watch Out",
    "url": "https://www.rottentomatoes.com/m/better_watch_out",
    "review": "A Yule-themed comedy horror that is neither funny, nor particularly horrifying, Better Watch Out feels like a malicious spin on Home Alone.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Better Watch Out",
    "url": "https://www.rottentomatoes.com/m/better_watch_out",
    "review": "Better Watch Out, directed and co-written by Chris Peckover, is a clever horror film that gets cleverer",
    "sentiment": "POSITIVE"
},
{
    "title": "Better Watch Out",
    "url": "https://www.rottentomatoes.com/m/better_watch_out",
    "review": "Bold, exhilarating and genuinely heartfelt. It's a musical biopic unlike anything you've seen before.",
    "sentiment": "POSITIVE"
},
{
    "title": "Better Watch Out",
    "url": "https://www.rottentomatoes.com/m/better_watch_out",
    "review": "I think it's a fantastic storyline but it may have taken it a step too far to be believable for me.",
    "sentiment": "POSITIVE"
},
{
    "title": "Better Watch Out",
    "url": "https://www.rottentomatoes.com/m/better_watch_out",
    "review": "Better Watch Out is the definition of a horror comedy, with great performances all around.",
    "sentiment": "POSITIVE"
},
{
    "title": "It's What's Inside",
    "url": "https://www.rottentomatoes.com/m/its_whats_inside",
    "review": "A welcome dose of shock therapy.",
    "sentiment": "POSITIVE"
},
{
    "title": "It's What's Inside",
    "url": "https://www.rottentomatoes.com/m/its_whats_inside",
    "review": "An ingenious, wildly stylish new take on the body-swap movie, this deserves to be a Gen-Z cult classic.",
    "sentiment": "POSITIVE"
},
{
    "title": "It's What's Inside",
    "url": "https://www.rottentomatoes.com/m/its_whats_inside",
    "review": "“It’s What’s Inside” is a fun jaunt through the dynamics of a friend group and the interiorities of its members, even as it sanitizes its potential.",
    "sentiment": "POSITIVE"
},
{
    "title": "It's What's Inside",
    "url": "https://www.rottentomatoes.com/m/its_whats_inside",
    "review": "A bunch of fun to experience in a giddy daze or perhaps with pen and paper in hand, mapping shifting identities and how current motivations are driven by past feelings and lingering curiosities.",
    "sentiment": "POSITIVE"
},
{
    "title": "It's What's Inside",
    "url": "https://www.rottentomatoes.com/m/its_whats_inside",
    "review": "Jardin's brings his solid, if flawed, screenplay to life with gorgeous visuals and a game cast.",
    "sentiment": "POSITIVE"
},
{
    "title": "It's What's Inside",
    "url": "https://www.rottentomatoes.com/m/its_whats_inside",
    "review": "Jardin's directorial eye is the film's greatest asset. Visually, this is a great calling card. Narratively, though, there are some weaknesses: fewer characters and a more adventurous swapping of the genders would have made the story stronger.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Bikeriders",
    "url": "https://www.rottentomatoes.com/m/the_bikeriders",
    "review": "Nichols shows us that even when it all goes sour, the excitement of this ridiculous and aggressive world is catnip to the born outsider.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Bikeriders",
    "url": "https://www.rottentomatoes.com/m/the_bikeriders",
    "review": "Most contemporary westerns end up mourning a vanished era of compromised freedom. The Bikeriders doesn’t quite believe in that myth, but it still finds time to dampen a handkerchief as its shadow recedes. A flawed, fascinating film.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Bikeriders",
    "url": "https://www.rottentomatoes.com/m/the_bikeriders",
    "review": "It’s the other elements – plot, storytelling, script, emotional connections, engaging the viewer – that fall off the bike.",
    "sentiment": "NEGATIVE"
},
{
    "title": "The Bikeriders",
    "url": "https://www.rottentomatoes.com/m/the_bikeriders",
    "review": "There’s a rare quality within Jeff Nichols films that cinema has desperately yearned for.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Bikeriders",
    "url": "https://www.rottentomatoes.com/m/the_bikeriders",
    "review": "Primary to Jeff Nichols's brilliant five-act film is the female perspective of its protagonist Kathy. Jodie Comer gives an Oscar-worthy performance that defies all expectation.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Bikeriders",
    "url": "https://www.rottentomatoes.com/m/the_bikeriders",
    "review": "Yeah, there’s some pleasure to be had from the period music and costuming. But if you can’t care about the characters, what’s the point?",
    "sentiment": "NEGATIVE"
},
{
    "title": "Challengers",
    "url": "https://www.rottentomatoes.com/m/challengers_2024",
    "review": "All’s fair in love and tennis: it’s a brutal, animalistic tussle that leaves no one unscathed.",
    "sentiment": "POSITIVE"
},
{
    "title": "Challengers",
    "url": "https://www.rottentomatoes.com/m/challengers_2024",
    "review": "Guadagnino knows how to make people very, very attractive. But that’s not the same as interesting.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Challengers",
    "url": "https://www.rottentomatoes.com/m/challengers_2024",
    "review": "Challengers hails the voyeuristic spectator at every turn: It’s a movie as much about watching as about performing, as much about scopophilia as exhibitionism.",
    "sentiment": "POSITIVE"
},
{
    "title": "Challengers",
    "url": "https://www.rottentomatoes.com/m/challengers_2024",
    "review": "Challengers is all about status and power. Who has it, and how they wield it. Who doesn’t have it, and what they’ll do to acquire it.",
    "sentiment": "POSITIVE"
},
{
    "title": "Challengers",
    "url": "https://www.rottentomatoes.com/m/challengers_2024",
    "review": "Luca Guadagnino's psychologically intriguing concept is erotically-charged and enigmatic -- which is what distinguishes it from other sports-themed dramas.",
    "sentiment": "POSITIVE"
},
{
    "title": "Challengers",
    "url": "https://www.rottentomatoes.com/m/challengers_2024",
    "review": "A triumph of filmmaking. The score pulsates throughout the movie, expertly accentuating performances from three of the most magnetic actors working today who are being guided by a director who understands young, raw talent like nobody else in the industry",
    "sentiment": "POSITIVE"
},
{
    "title": "Blitz",
    "url": "https://www.rottentomatoes.com/m/blitz",
    "review": "Blitz often feels like a pitched battle between the conventions of big-canvas war recreation and an attempt to evoke the stranger, less obviously narrative-driven chaos that happens when the battlefield descends on a major urban center from the sky.",
    "sentiment": "POSITIVE"
},
{
    "title": "Blitz",
    "url": "https://www.rottentomatoes.com/m/blitz",
    "review": "Blitz knows what it's doing and why, but its compromises may be more self-deceiving than subversive. Cloaking himself more heavily than ever in populist hand-me-downs, McQueen gets swallowed up by his own brilliant disguise.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Blitz",
    "url": "https://www.rottentomatoes.com/m/blitz",
    "review": "McQueen, whose unflinching \"12 Years a Slave\" won Best Picture in 2013, softens his touch a bit here. But his eye is as sharp as ever, and he identifies beauty even in the darkest of spaces...",
    "sentiment": "POSITIVE"
},
{
    "title": "Blitz",
    "url": "https://www.rottentomatoes.com/m/blitz",
    "review": "George's incredible journey is extremely compelling, as is his mother's determination to find him. This movie is loaded with great performances, compelling narratives and characters. It is about evil, and those who oppose evil, even when all seems lost.",
    "sentiment": "POSITIVE"
},
{
    "title": "Blitz",
    "url": "https://www.rottentomatoes.com/m/blitz",
    "review": "While I appreciated the bleak moments, Blitz is ultimately uplifting. The film is a tribute to a people, not necessarily unified culturally or politically, who shared a common desire to survive, save their children, and defeat totalitarianism.",
    "sentiment": "POSITIVE"
},
{
    "title": "Blitz",
    "url": "https://www.rottentomatoes.com/m/blitz",
    "review": "It is honest, sometimes inspired, and empathetic most of the time -in its own, mildly revisionist way.",
    "sentiment": "POSITIVE"
},
{
    "title": "Twisters",
    "url": "https://www.rottentomatoes.com/m/twisters",
    "review": "I wasn't blown away by it... It's not particularly well-written.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Twisters",
    "url": "https://www.rottentomatoes.com/m/twisters",
    "review": "It’s like you’re chasing tornados from the front seat of a roller coaster.",
    "sentiment": "POSITIVE"
},
{
    "title": "Twisters",
    "url": "https://www.rottentomatoes.com/m/twisters",
    "review": "A couple of reasonable expectations… that are completely absent: three-dimensional characters and a sincere appreciation for the landscapes and the inhabitants of these small towns.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Twisters",
    "url": "https://www.rottentomatoes.com/m/twisters",
    "review": "Twisters is a big, loud summer blockbuster, but it won’t blow you away.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Twisters",
    "url": "https://www.rottentomatoes.com/m/twisters",
    "review": "Twisters is watchable enough, and even broadly entertaining in its modest way. Sadly it will also remind the older viewer of a much better and much more enjoyable blockbuster.",
    "sentiment": "POSITIVE"
},
{
    "title": "Twisters",
    "url": "https://www.rottentomatoes.com/m/twisters",
    "review": "At just under two hours, “Twisters” is a thrill ride of a film with a country-heavy soundtrack that I, an avowed country music hater, didn’t hate.",
    "sentiment": "POSITIVE"
},
{
    "title": "Tim Burton's The Nightmare Before Christmas",
    "url": "https://www.rottentomatoes.com/m/the_nightmare_before_christmas",
    "review": "I'm blown away by just the construction of the scenes, and by all of the effects that have been incorporated to make everything move fluidly; and there's also this charming imperfection to the animation that just makes it so gorgeous.",
    "sentiment": "POSITIVE"
},
{
    "title": "Tim Burton's The Nightmare Before Christmas",
    "url": "https://www.rottentomatoes.com/m/the_nightmare_before_christmas",
    "review": "Part avant-garde art film, part amusing but morbid fairy tale, it is a delightfully ghoulish holiday musical that displays more inventiveness in its brief 75 minutes than some studios can manage in an entire year.",
    "sentiment": "POSITIVE"
},
{
    "title": "Tim Burton's The Nightmare Before Christmas",
    "url": "https://www.rottentomatoes.com/m/the_nightmare_before_christmas",
    "review": "This full-length animated movie was shot in stop motion, with all the febrile, twittery fascination that the medium exerts; it has a magic-toy shop feeling, with unexpected objects stuttering into life.",
    "sentiment": "POSITIVE"
},
{
    "title": "Tim Burton's The Nightmare Before Christmas",
    "url": "https://www.rottentomatoes.com/m/the_nightmare_before_christmas",
    "review": "The Nightmare Before Christmas is unique and timeless, a magical adventure that’ll delight the senses and steal your heart.",
    "sentiment": "POSITIVE"
},
{
    "title": "Tim Burton's The Nightmare Before Christmas",
    "url": "https://www.rottentomatoes.com/m/the_nightmare_before_christmas",
    "review": "One of the best films of all-time, the gorgeous stop-motion animation and story of Jack Skellington longing for something more leaves us breathless, happy and fulfilled.",
    "sentiment": "POSITIVE"
},
{
    "title": "Tim Burton's The Nightmare Before Christmas",
    "url": "https://www.rottentomatoes.com/m/the_nightmare_before_christmas",
    "review": "In the days of computer-animated films that occasionally appear no different than your average videogame, looking back, we must appreciate that Tim Burton and Henry Selick created something so wonderfully original.",
    "sentiment": "POSITIVE"
},
{
    "title": "Gladiator",
    "url": "https://www.rottentomatoes.com/m/gladiator",
    "review": "The same sturdy conventionality that made Gladiator a hit means that it’s built to last without standing particularly tall. With apologies to Ridley Scott, it holds up fine without echoing into eternity.",
    "sentiment": "POSITIVE"
},
{
    "title": "Gladiator",
    "url": "https://www.rottentomatoes.com/m/gladiator",
    "review": "It is an honorable movie, so are they all honorable movies. But that's not enough. It's not great. It's a disappointment. Caesar hates disappointment, so kill it swiftly and be done.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Gladiator",
    "url": "https://www.rottentomatoes.com/m/gladiator",
    "review": "The new film has spectacular fight scenes in dazzling sets and a familiar story about honor and betrayal, courage and cowardice. It's the perfect vehicle for some old-fashioned sword-clanging fun.",
    "sentiment": "POSITIVE"
},
{
    "title": "Gladiator",
    "url": "https://www.rottentomatoes.com/m/gladiator",
    "review": "As iconic as Ridley Scott's Gladiator is, a better film would exist beneath its legendary dialogue and battle scenes in the form of a sharper script.",
    "sentiment": "POSITIVE"
},
{
    "title": "Gladiator",
    "url": "https://www.rottentomatoes.com/m/gladiator",
    "review": "The enduring success of Gladiator lies in many factors, one of which is Scott’s modern sensibility in his direction that appeals even to contemporary audiences.",
    "sentiment": "POSITIVE"
},
{
    "title": "Gladiator",
    "url": "https://www.rottentomatoes.com/m/gladiator",
    "review": "Scott’s films lurch all over the place in terms in quality, but when the material rises to match his sheer movie-making suss, the results can be fabulous.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Santa Clause",
    "url": "https://www.rottentomatoes.com/m/santa_clause",
    "review": "A genial, lightweight entertainment.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Santa Clause",
    "url": "https://www.rottentomatoes.com/m/santa_clause",
    "review": "This is Allen's movie debut, and it's easy to see why his show is a ratings smash. There's an effortless quality to his humor, but it's also got a quietly urgent edge to it.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Santa Clause",
    "url": "https://www.rottentomatoes.com/m/santa_clause",
    "review": "I was surprised to find The Santa Clause rather easier to take than anticipated.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Santa Clause",
    "url": "https://www.rottentomatoes.com/m/santa_clause",
    "review": "There's a laughable edge that makes it all entertaining - not hilarious, just chuckle kind of chuckles...",
    "sentiment": "POSITIVE"
},
{
    "title": "The Santa Clause",
    "url": "https://www.rottentomatoes.com/m/santa_clause",
    "review": "The original is actually quite entertaining, with Allen's sardonic wit standing in gleeful contrast to his surroundings...",
    "sentiment": "POSITIVE"
},
{
    "title": "The Santa Clause",
    "url": "https://www.rottentomatoes.com/m/santa_clause",
    "review": "...a perfectly watchable yet entirely unmemorable family-friendly...",
    "sentiment": "POSITIVE"
},
{
    "title": "Dirty Angels",
    "url": "https://www.rottentomatoes.com/m/dirty_angels",
    "review": "This erratically plotted and scripted one off is not only a  far cry from Campbell’s action heyday of “Casino Royale” but never capitalizes on anything nor anybody, not only Green but costars Maria Bakalova and Ruby Rose.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Dirty Angels",
    "url": "https://www.rottentomatoes.com/m/dirty_angels",
    "review": "If you’re looking for that kind of mindless throwback violence, “Dirty Angels” delivers. If only it weren’t such a bore.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Dirty Angels",
    "url": "https://www.rottentomatoes.com/m/dirty_angels",
    "review": "While the movie flouts traditional gender roles, it easily plays into stereotypes about race and religion.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Dirty Angels",
    "url": "https://www.rottentomatoes.com/m/dirty_angels",
    "review": "In tandem with his co-writers, Campbell realizes that while gunfire, bombs, and car chases are integral to this type of movie, it will fall apart without an interesting, compelling main story, and a few surprise subplot twists along the way.",
    "sentiment": "POSITIVE"
},
{
    "title": "Dirty Angels",
    "url": "https://www.rottentomatoes.com/m/dirty_angels",
    "review": "Dirty Angels is tone-deaf through and through and only finds that groove of entertaining action jingoism in its final 20 minutes; the previous 80 are mostly upsetting and not in the way Martin Campbell intended",
    "sentiment": "NEGATIVE"
},
{
    "title": "Dirty Angels",
    "url": "https://www.rottentomatoes.com/m/dirty_angels",
    "review": "Martin Campbell's latest action movie is yet another misfire.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Madame Web",
    "url": "https://www.rottentomatoes.com/m/madame_web",
    "review": "This clairvoyant superhero origin story starring Dakota Johnson is a failure in just about every way.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Madame Web",
    "url": "https://www.rottentomatoes.com/m/madame_web",
    "review": "Johnson tries to evoke Cassandra’s inner turmoil, and the scenes between her and Scott offer glimpses of a more promising project. But any potential gets buried early, beneath clumsy exposition, clunky special effects, and disconnected editing.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Madame Web",
    "url": "https://www.rottentomatoes.com/m/madame_web",
    "review": "But where the dialogue needed wit and spark, it has the kind of will-this-do one-liners (\"Hope the spiders were worth it, Mom!\") and tired backstories you get when the characters are too flat to flesh out with rounded personalities.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Madame Web",
    "url": "https://www.rottentomatoes.com/m/madame_web",
    "review": "Madame Web‘s tenuous grasp on the viewer is loosened significantly once it moves into its episodic, meandering midsection...",
    "sentiment": "NEGATIVE"
},
{
    "title": "Madame Web",
    "url": "https://www.rottentomatoes.com/m/madame_web",
    "review": "Madame Web is not fun and not entertaining. Most of all, it’s disappointing, because it teases you with possibilities that never come to bear.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Madame Web",
    "url": "https://www.rottentomatoes.com/m/madame_web",
    "review": "Madame Web is destined for endless memes and the “so bad it’s good” treatment. People tried to do the same with Morbius, yet in this case, we have a movie that you can tell had a unique vision at first but was stumped by Sony’s usual studio antics.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Man of Steel",
    "url": "https://www.rottentomatoes.com/m/superman_man_of_steel",
    "review": "Snyder is an adrenaline junkie forever jonesing for a fix; he does less building to the action beats than backing each one into the next.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Man of Steel",
    "url": "https://www.rottentomatoes.com/m/superman_man_of_steel",
    "review": "Clark's multiple father-and-son tales are beautifully realized and it's a very fun movie to watch. However, the romance is shallow.",
    "sentiment": "POSITIVE"
},
{
    "title": "Man of Steel",
    "url": "https://www.rottentomatoes.com/m/superman_man_of_steel",
    "review": "A gritty, realistic story shot by a director whose instincts constantly push him away from grit and realism, and into flash and fantasy.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Man of Steel",
    "url": "https://www.rottentomatoes.com/m/superman_man_of_steel",
    "review": "Man of Steel is a genre story without the cartoon-like elements seen in past superhero films, presenting a gritty, torment-ridden reboot of the character’s origin story with intense emotional genuineness.",
    "sentiment": "POSITIVE"
},
{
    "title": "Man of Steel",
    "url": "https://www.rottentomatoes.com/m/superman_man_of_steel",
    "review": "While it might set itself apart from many superhero movies that came before it, it seems to do so arbitrarily as opposed to exploring those ideas in any organic way.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Man of Steel",
    "url": "https://www.rottentomatoes.com/m/superman_man_of_steel",
    "review": "Man of Steel was Snyder’s triumphant debut with Superman, and it’s still a thrilling example of why Clark Kent can be an engaging lead for one of these movies despite the speculation for the opposite.",
    "sentiment": "POSITIVE"
},
{
    "title": "Megalopolis",
    "url": "https://www.rottentomatoes.com/m/megalopolis",
    "review": "I love the earnestness, sincerity, and ingenuity behind this... I can't say it's good, but I think people should see it -- and in IMAX to take in the enormity of it all.",
    "sentiment": "POSITIVE"
},
{
    "title": "Megalopolis",
    "url": "https://www.rottentomatoes.com/m/megalopolis",
    "review": "...unabashedly, absurdly theatrical, with boldly unnatural dialogue and performances, ostentatious imagery, and one extended cross-cutting sequence that’s as potent as any Coppola has produced.",
    "sentiment": "POSITIVE"
},
{
    "title": "Megalopolis",
    "url": "https://www.rottentomatoes.com/m/megalopolis",
    "review": "A zero-star, wacko disaster...",
    "sentiment": "NEGATIVE"
},
{
    "title": "Megalopolis",
    "url": "https://www.rottentomatoes.com/m/megalopolis",
    "review": "Coppola's ambition is buried under the rubble of what could have been a great city. [Full review in Spanish]",
    "sentiment": "NEGATIVE"
},
{
    "title": "Megalopolis",
    "url": "https://www.rottentomatoes.com/m/megalopolis",
    "review": "Francis Ford Coppola’s Megalopolis is a fascinating “mess,” existing primarily as an epic, must-see, PLF-worthy ode to its own existence.",
    "sentiment": "POSITIVE"
},
{
    "title": "Megalopolis",
    "url": "https://www.rottentomatoes.com/m/megalopolis",
    "review": "Sometimes beautiful, at other times, horrible; inspired by mythology, history, philosophy and theatre, but also by the digital aesthetics of 21st-century superhero cinema; energetic in some instances, but tedious in others. Full review in Spanish.",
    "sentiment": "POSITIVE"
},
{
    "title": "My Old Ass",
    "url": "https://www.rottentomatoes.com/m/my_old_ass",
    "review": "It takes all of Plaza’s weird chanting inflections and Stella’s exuberantly twitchy enthusiasm to make it pay off — but it does, with sly charm.",
    "sentiment": "POSITIVE"
},
{
    "title": "My Old Ass",
    "url": "https://www.rottentomatoes.com/m/my_old_ass",
    "review": "It's a simple idea... the thing is, that it's done with real tenderness and insight.",
    "sentiment": "POSITIVE"
},
{
    "title": "My Old Ass",
    "url": "https://www.rottentomatoes.com/m/my_old_ass",
    "review": "It’s a fun, silly premise, but while there’s no shortage of stoner humour, the film is deeper and considerably more satisfying than the drug-baked adolescent wisecracking might initially suggest.",
    "sentiment": "POSITIVE"
},
{
    "title": "My Old Ass",
    "url": "https://www.rottentomatoes.com/m/my_old_ass",
    "review": "An unusual coming-of-age comedy about learning from the choices you can make from your older self.",
    "sentiment": "POSITIVE"
},
{
    "title": "My Old Ass",
    "url": "https://www.rottentomatoes.com/m/my_old_ass",
    "review": "The film is meant to be a comedy – I think the title definitely suggests that – but the cast brings so much poignancy to the set pieces in the film. There are parts to this that are just completely devastating, and so well-acted by both Stella and Plaza.",
    "sentiment": "POSITIVE"
},
{
    "title": "My Old Ass",
    "url": "https://www.rottentomatoes.com/m/my_old_ass",
    "review": "…a provocative, female-led narrative, playing down all comical or potentially silly elements in favor of a welcome, serious personal development angle…this is about a serious character in conflict, so don’t expect Big/Freaky Friday body-swap shenanigans.",
    "sentiment": "POSITIVE"
},
{
    "title": "Ferry 2",
    "url": "https://www.rottentomatoes.com/m/ferry_2",
    "review": "If you like The Batman and if you have recently watched The Penguin and you are looking for gritty and grimy stuff like that, I suppose that these 2 movies are a good place to start.",
    "sentiment": "POSITIVE"
},
{
    "title": "Ferry 2",
    "url": "https://www.rottentomatoes.com/m/ferry_2",
    "review": "Ferry 2, on Netflix, is an entertaining watch that is simple and unmemorable and provides little else.",
    "sentiment": "POSITIVE"
},
{
    "title": "Trap",
    "url": "https://www.rottentomatoes.com/m/trap_2024",
    "review": "While Shyamalan has an eye for a Hitchcockian “aha” moment and a great sense of suspense, he stretches willing suspension of disbelief just a little too far, making Trap more of an acting showcase than a thriller masterclass.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Trap",
    "url": "https://www.rottentomatoes.com/m/trap_2024",
    "review": "It's not as good as his best work; it's not as bad as his worst work, but it does encapsulate the thing that makes [Shyamalan] so infuriating.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Trap",
    "url": "https://www.rottentomatoes.com/m/trap_2024",
    "review": "For some, puzzling out the “big twist” will be enough to sustain interest in the enjoyable, if nonsensical, third act. The real twist, for me, was realizing that The Sixth Sense came out 25 years ago.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Trap",
    "url": "https://www.rottentomatoes.com/m/trap_2024",
    "review": "Trap is not without its deeper dimensions. The surface is all thrills and chills, but slowly in his script Shyamalan also interweaves this rumination on identity.",
    "sentiment": "POSITIVE"
},
{
    "title": "Trap",
    "url": "https://www.rottentomatoes.com/m/trap_2024",
    "review": "The performances from both [Josh Hartnett and Alison Pill] are just stellar – so much tension and emotional stakes. Hartnett also delivers the best pie acting since James Franco in Spider-Man 3.",
    "sentiment": "POSITIVE"
},
{
    "title": "Trap",
    "url": "https://www.rottentomatoes.com/m/trap_2024",
    "review": "The highlight of the whole film might be the bit part played by Kid Cudi in absolute diva/bitch mode.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Krampus",
    "url": "https://www.rottentomatoes.com/m/krampus",
    "review": "Some clever soul might have done something moderately effective with this idea, but Krampus is too dumb to be scary and too listless to be entertaining.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Krampus",
    "url": "https://www.rottentomatoes.com/m/krampus",
    "review": "Otherwise, this holiday-season fright flick never leaps far enough outside of its own box; the movie flirts with going full-on monster mash, with really cutting loose, but the mayhem is too little, too late.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Krampus",
    "url": "https://www.rottentomatoes.com/m/krampus",
    "review": "The legend of the Krampus, often referred to as the shadow of St. Nicholas, is a fertile one indeed, but this \"Krampus\" - a missed opportunity for anti-saccharine counter programming - isn't likely to create many new believers.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Krampus",
    "url": "https://www.rottentomatoes.com/m/krampus",
    "review": "As it is, it’s like a stocking crammed with too many little bits and bobs that came to mind for the stocking-stuffer, ultimately pleasing no one like one or two well-considered big gifts would have.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Krampus",
    "url": "https://www.rottentomatoes.com/m/krampus",
    "review": "Dougherty's movie is best when it's taking a cynical look at holiday celebrations, while the horror elements seem flat by comparison.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Krampus",
    "url": "https://www.rottentomatoes.com/m/krampus",
    "review": "Outside of those nonsubstantive additions, The Naughty Cut is identical to the horror-comedy's theatrical version, and so remains an easy recommendation.",
    "sentiment": "POSITIVE"
},
{
    "title": "Transformers One",
    "url": "https://www.rottentomatoes.com/m/transformers_one",
    "review": "A refreshingly new breed of Autobot adventure -- one that has been notably souped-up in the brains department.",
    "sentiment": "POSITIVE"
},
{
    "title": "Transformers One",
    "url": "https://www.rottentomatoes.com/m/transformers_one",
    "review": "The screenplay from Eric Pearson, Andrew Barrer and Gabriel Ferrari is wildly ambitious, and includes the kind of next-level detail you wouldn't expect in a Spielbergian epic, let alone an angry android movie.",
    "sentiment": "POSITIVE"
},
{
    "title": "Transformers One",
    "url": "https://www.rottentomatoes.com/m/transformers_one",
    "review": "It's got lots of smashy-bashy action, satisfyingly crunchy silly machine Transformation, it's got a not-so-subtle message about power corrupting, and it's even got a couple of jokes that I actually laughed at.",
    "sentiment": "POSITIVE"
},
{
    "title": "Transformers One",
    "url": "https://www.rottentomatoes.com/m/transformers_one",
    "review": "Uwe Boll could make a Transformers film for a buck fifty and employ only sock puppets and it would be praised to the high heavens simply for not being directed by Michael Bay. That’s the takeaway one gets after watching Bumblebee and now Transformers One.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Transformers One",
    "url": "https://www.rottentomatoes.com/m/transformers_one",
    "review": "Blessed with a strong, well-developed screenplay, the film boasts funny and engaging characters, inventive and eye-catching design, and tells a decent all-ages science fiction adventure.",
    "sentiment": "POSITIVE"
},
{
    "title": "Transformers One",
    "url": "https://www.rottentomatoes.com/m/transformers_one",
    "review": "It is a good starting place if you are either someone who's brand new to Transformers entirely or if you have seen other Transformers movies... this is a nice primer.",
    "sentiment": "POSITIVE"
},
{
    "title": "Violent Night",
    "url": "https://www.rottentomatoes.com/m/violent_night",
    "review": "It ain’t Miracle on 34th Street, but it’s a popcorn flick that has cult classic written all over it.",
    "sentiment": "POSITIVE"
},
{
    "title": "Violent Night",
    "url": "https://www.rottentomatoes.com/m/violent_night",
    "review": "It’s like attending a party where no two guests are on sufficiently good terms to manage even 20 minutes of civilised conversation. “Perfect for Christmas Day then,” I hear you say. Too cynical.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Violent Night",
    "url": "https://www.rottentomatoes.com/m/violent_night",
    "review": "112 minutes of your life rather than a day, which is a small gift...",
    "sentiment": "NEGATIVE"
},
{
    "title": "Violent Night",
    "url": "https://www.rottentomatoes.com/m/violent_night",
    "review": "V.N. pays its respect to the cult Holiday classic Home Alone and is easily one of the funniest movies of the year. There are also some heartfelt moments, occasional bits of humanity and a traditional redemption story arc thrown in the blood-filled mix.",
    "sentiment": "POSITIVE"
},
{
    "title": "Violent Night",
    "url": "https://www.rottentomatoes.com/m/violent_night",
    "review": "Closing the film with Slade’s “Merry Xmas Everybody” was the perfect ending to a near-perfect film, and it’s definitely a must-see this holiday season.",
    "sentiment": "POSITIVE"
},
{
    "title": "Violent Night",
    "url": "https://www.rottentomatoes.com/m/violent_night",
    "review": "Did we need a shallow dive into a deeper, new lore about Santa? No. Do we need the inevitable sequel with Valkyrie Mrs. Claus? Probably not...",
    "sentiment": "NEGATIVE"
},
{
    "title": "Home Alone 2: Lost in New York",
    "url": "https://www.rottentomatoes.com/m/home_alone_2_lost_in_new_york",
    "review": "Culkin is breezily winning once again as the self-reliant kid alone, while Pesci and Stern deserve combat metals (especially Stern) to the bricks and slings they endure.",
    "sentiment": "POSITIVE"
},
{
    "title": "Home Alone 2: Lost in New York",
    "url": "https://www.rottentomatoes.com/m/home_alone_2_lost_in_new_york",
    "review": "It's much more violent than the first film's comparable set of dirty tricks. And Kevin, removed from his embattled home, seems much more cavalier, possibly even meaner than his bullying older brother, Buzz (Devin Ratray).",
    "sentiment": "NEGATIVE"
},
{
    "title": "Home Alone 2: Lost in New York",
    "url": "https://www.rottentomatoes.com/m/home_alone_2_lost_in_new_york",
    "review": "The pleasures here are entirely cruel, with an unhealthy concentration on the suffering of the victims, on the thudding impact of various objects against their heads, on their howls of agony.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Home Alone 2: Lost in New York",
    "url": "https://www.rottentomatoes.com/m/home_alone_2_lost_in_new_york",
    "review": "Home Alone 2: Lost in New York manages to up the stakes while Kevin has to fend for himself in a very different environment.",
    "sentiment": "POSITIVE"
},
{
    "title": "Home Alone 2: Lost in New York",
    "url": "https://www.rottentomatoes.com/m/home_alone_2_lost_in_new_york",
    "review": "Sorely lacks the situational specificity and just the vague whiff of 'this could actually happen' from the previous film.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Home Alone 2: Lost in New York",
    "url": "https://www.rottentomatoes.com/m/home_alone_2_lost_in_new_york",
    "review": "...the movie admittedly boasts (and benefits from) an ongoing emphasis on appealing, engaging elements...",
    "sentiment": "POSITIVE"
},
{
    "title": "Christmas With the Kranks",
    "url": "https://www.rottentomatoes.com/m/christmas_with_the_kranks",
    "review": "Unoriginal, unfunny slapstick holiday fare.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Christmas With the Kranks",
    "url": "https://www.rottentomatoes.com/m/christmas_with_the_kranks",
    "review": "In any normal year this dire comedy would be the undisputed lump of coal in our psychic stocking, but coming on the heels of Surviving Christmas, it's a close second.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Christmas With the Kranks",
    "url": "https://www.rottentomatoes.com/m/christmas_with_the_kranks",
    "review": "[A] comedy so broad it barely dents its targets and a patronising moral conclusion that goes against everything its protagonists originally stood for.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Christmas With the Kranks",
    "url": "https://www.rottentomatoes.com/m/christmas_with_the_kranks",
    "review": "This exhausting parade of white people's Christmas problems offers only banality, blandness, and the most desperately unfunny sitcom hijinks imaginable.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Christmas With the Kranks",
    "url": "https://www.rottentomatoes.com/m/christmas_with_the_kranks",
    "review": "Allen was a bit low energy for my liking but actually came off better in his more sincere scenes towards the end of the film.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Christmas With the Kranks",
    "url": "https://www.rottentomatoes.com/m/christmas_with_the_kranks",
    "review": "We loved him as Santa. We loved her as the hooker with a heart. We love Christmas. ... After seeing Christmas with the Kranks, all I can say is it put me in one kranky mood for the holidays over such a waste of talent!",
    "sentiment": "NEGATIVE"
},
{
    "title": "The Polar Express",
    "url": "https://www.rottentomatoes.com/m/polar_express",
    "review": "The schmaltz content gets higher and higher, as if administered through a drip feed, until by the end we are drowning in sucrose.",
    "sentiment": "NEGATIVE"
},
{
    "title": "The Polar Express",
    "url": "https://www.rottentomatoes.com/m/polar_express",
    "review": "People in Hollywood should never work with children or animals, W.C. Fields once said. Maybe that should be expanded to hyper-realistic computer-generated children and reindeer, too.",
    "sentiment": "NEGATIVE"
},
{
    "title": "The Polar Express",
    "url": "https://www.rottentomatoes.com/m/polar_express",
    "review": "As a spectacle, The Polar Express looks remarkable. As a film, however, it's the equivalent of an elaborately wrapped Christmas present containing a nice new pair of socks.",
    "sentiment": "NEGATIVE"
},
{
    "title": "The Polar Express",
    "url": "https://www.rottentomatoes.com/m/polar_express",
    "review": "It’s not hard to see why this movie [The Polar Express] was optioned, but it is frustrating to see the concept wasted on a thin, meandering plot meant as a morality play.",
    "sentiment": "NEGATIVE"
},
{
    "title": "The Polar Express",
    "url": "https://www.rottentomatoes.com/m/polar_express",
    "review": "A “Harry Potter meets Scrooge” hodgepodge enacted on a plateau of plasticity.",
    "sentiment": "NEGATIVE"
},
{
    "title": "The Polar Express",
    "url": "https://www.rottentomatoes.com/m/polar_express",
    "review": "While on paper everything about The Polar Express seems to point towards the feature being a disaster, the final product stays on the rails to become anything but.",
    "sentiment": "POSITIVE"
},
{
    "title": "Woman of the Hour",
    "url": "https://www.rottentomatoes.com/m/woman_of_the_hour",
    "review": "Kendrick proves herself a formidable talent on both sides of the camera. The timeline can be choppy, but this is as considered as it is chilling.",
    "sentiment": "POSITIVE"
},
{
    "title": "Woman of the Hour",
    "url": "https://www.rottentomatoes.com/m/woman_of_the_hour",
    "review": "Kendrick’s knack for capturing period detail goes beyond the psychedelic synthetics and kipper ties. She taps into the treacherous sexism that was hardwired into the entertainment industry and wider culture of the time.",
    "sentiment": "POSITIVE"
},
{
    "title": "Woman of the Hour",
    "url": "https://www.rottentomatoes.com/m/woman_of_the_hour",
    "review": "I think she [Kendrick] has a really good sense of psychology.",
    "sentiment": "POSITIVE"
},
{
    "title": "Woman of the Hour",
    "url": "https://www.rottentomatoes.com/m/woman_of_the_hour",
    "review": "Woman of the Hour is a decent film, but it is also one that has struggled to find a defining through-line in terms of story, character, or theme.",
    "sentiment": "POSITIVE"
},
{
    "title": "Woman of the Hour",
    "url": "https://www.rottentomatoes.com/m/woman_of_the_hour",
    "review": "Woman of the Hour does well by taking the serial killer story as the starting point to try and listen to the horrors of everyday livelihood of women, when their voices are not just sidelined, but practically silenced.",
    "sentiment": "POSITIVE"
},
{
    "title": "Woman of the Hour",
    "url": "https://www.rottentomatoes.com/m/woman_of_the_hour",
    "review": "Kendrick, making her directorial debut here, smartly doesn’t linger on the horrific murders Alcala commits, but she doesn’t shy away from them either.",
    "sentiment": "POSITIVE"
},
{
    "title": "Chasing Chasing Amy",
    "url": "https://www.rottentomatoes.com/m/chasing_chasing_amy",
    "review": "The moment marks a turning point in Rodgers’s agreeable documentary, which sets out to provide a contemporary lens on “Chasing Amy.”",
    "sentiment": "POSITIVE"
},
{
    "title": "Chasing Chasing Amy",
    "url": "https://www.rottentomatoes.com/m/chasing_chasing_amy",
    "review": "Starts as another in a long line of disposable auto-docs from ppl desperate to lend their pop culture darlings greater cultural significance before becoming something a bit more complicated in its back half.",
    "sentiment": "POSITIVE"
},
{
    "title": "Chasing Chasing Amy",
    "url": "https://www.rottentomatoes.com/m/chasing_chasing_amy",
    "review": "\"Chasing Chasing Amy\" is an insightful look back at the movie and the place it occupies in queer culture, the '90s canon and the lives of those it touched, both for better and for worse. It's well worth chasing down.",
    "sentiment": "POSITIVE"
},
{
    "title": "Chasing Chasing Amy",
    "url": "https://www.rottentomatoes.com/m/chasing_chasing_amy",
    "review": "What starts out as an insightful retrospective look at ‘Chasing Amy’ as a queer film turns into an incredibly moving story of the film-makers own journey with their identity and sexuality.",
    "sentiment": "POSITIVE"
},
{
    "title": "Chasing Chasing Amy",
    "url": "https://www.rottentomatoes.com/m/chasing_chasing_amy",
    "review": "“Chasing Chasing Amy” is a unique film about how a movie can affect people differently and how even the filmmaker can’t predict what that outcome could be.",
    "sentiment": "POSITIVE"
},
{
    "title": "Chasing Chasing Amy",
    "url": "https://www.rottentomatoes.com/m/chasing_chasing_amy",
    "review": "Does an amazing job of examining the problematic elements of the film’s story arc, as well as getting a lot of info on the genesis of the script, and most importantly, detailing Sav’s journey of discovery throughout the entire process.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Holiday",
    "url": "https://www.rottentomatoes.com/m/the_holiday",
    "review": "You begin to suspect that Meyers isn't actually a movie director at all, but a features coordinator at World of Interiors.",
    "sentiment": "NEGATIVE"
},
{
    "title": "The Holiday",
    "url": "https://www.rottentomatoes.com/m/the_holiday",
    "review": "The Holiday is as corny as it gets, but in a cinemascape full of macho grunting and aggressive irony, Meyers is perhaps right to believe that corniness is what women - and their boyfriends - will be wanting...",
    "sentiment": "POSITIVE"
},
{
    "title": "The Holiday",
    "url": "https://www.rottentomatoes.com/m/the_holiday",
    "review": "What makes The Holiday interesting - and worth reexamining more than a decade after its release - is that unlike most holiday-themed movies, it exhorts the viewer to take time for themselves, not just others. It's the ultimate self-care flick.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Holiday",
    "url": "https://www.rottentomatoes.com/m/the_holiday",
    "review": "The Holiday is still so utterly charming. It's like a warm hug, perfect for any time of the year but especially fitting for Christmas. The cast is stellar and Jude Law as daddy Mr Napkinhead is so swoonworthy my TV caught fire.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Holiday",
    "url": "https://www.rottentomatoes.com/m/the_holiday",
    "review": "A really sweet and endearing holiday rom-com",
    "sentiment": "POSITIVE"
},
{
    "title": "The Holiday",
    "url": "https://www.rottentomatoes.com/m/the_holiday",
    "review": "Charming and impeccably scored...",
    "sentiment": "POSITIVE"
},
{
    "title": "Carol",
    "url": "https://www.rottentomatoes.com/m/carol",
    "review": "A wonderful and all-too-rare film.",
    "sentiment": "POSITIVE"
},
{
    "title": "Carol",
    "url": "https://www.rottentomatoes.com/m/carol",
    "review": "It makes me wish the word \"epic\" hadn't been completely diluted so I could bring the full weight of its meaning to bear on this love story. Extraordinary? Singular? Remarkable? Yes, all of those things too.",
    "sentiment": "POSITIVE"
},
{
    "title": "Carol",
    "url": "https://www.rottentomatoes.com/m/carol",
    "review": "To call Carol a Christmas miracle feels like a gaudy understatement, but that's sort of exactly what it is.",
    "sentiment": "POSITIVE"
},
{
    "title": "Carol",
    "url": "https://www.rottentomatoes.com/m/carol",
    "review": "Carol is arguably my pick for the most beautiful film I’ve seen in 2015. By choosing to focus primarily on setting and theme to drive the story, the true colors of this film are able to shine more clearly...",
    "sentiment": "POSITIVE"
},
{
    "title": "Carol",
    "url": "https://www.rottentomatoes.com/m/carol",
    "review": "I loved it. I’m so glad that I saw it and that it exists in the world. It has definitely moved representations of lesbians forward, and I hope that the next time a movie like this is made, more viewers will be better able to feel it.",
    "sentiment": "POSITIVE"
},
{
    "title": "Carol",
    "url": "https://www.rottentomatoes.com/m/carol",
    "review": "A beautifully made film and moving love story",
    "sentiment": "POSITIVE"
},
{
    "title": "365 Days",
    "url": "https://www.rottentomatoes.com/m/365_days_2020",
    "review": "Come for the simulated bumping and grinding, stay for the ridiculous drama, stilted acting, hilarious soundtrack, and laughably offensive ideas about male and female desire.",
    "sentiment": "NEGATIVE"
},
{
    "title": "365 Days",
    "url": "https://www.rottentomatoes.com/m/365_days_2020",
    "review": "There haven't been line readings this poor since the third act of The Room...",
    "sentiment": "NEGATIVE"
},
{
    "title": "365 Days",
    "url": "https://www.rottentomatoes.com/m/365_days_2020",
    "review": "Thoroughly terrible, politically objectionable, occasionally hilarious...",
    "sentiment": "NEGATIVE"
},
{
    "title": "365 Days",
    "url": "https://www.rottentomatoes.com/m/365_days_2020",
    "review": "This repugnant Fifty Shades knockoff plays like an erotic rewrite of The Unbreakable Kimmy Schmidt.",
    "sentiment": "NEGATIVE"
},
{
    "title": "365 Days",
    "url": "https://www.rottentomatoes.com/m/365_days_2020",
    "review": "The Room meets Beauty and the Beast, 50 Shades of Grey and the stockholm syndrome in this cheesy erotic thriller with not a single positive aspect about it. Why such a product is Netflix's top movie of 2020 baffles almost everyone.",
    "sentiment": "NEGATIVE"
},
{
    "title": "365 Days",
    "url": "https://www.rottentomatoes.com/m/365_days_2020",
    "review": "If you find yourself watching this make zero expectations. [Full Review in Spanish]",
    "sentiment": "NEGATIVE"
},
{
    "title": "Dr. Seuss' The Grinch",
    "url": "https://www.rottentomatoes.com/m/the_grinch",
    "review": "The Grinch is bright and colorful, but the narrative feels a bit off from the anti-consumerist message that Dr. Seuss may have originally intended.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Dr. Seuss' The Grinch",
    "url": "https://www.rottentomatoes.com/m/the_grinch",
    "review": "[The Grinch] is excessively well-meaning and very tame. No doubt it will please those who will always love the story, no matter what shape it takes, but you have to be a fan.",
    "sentiment": "POSITIVE"
},
{
    "title": "Dr. Seuss' The Grinch",
    "url": "https://www.rottentomatoes.com/m/the_grinch",
    "review": "Cumberbatch... does not let us down.",
    "sentiment": "POSITIVE"
},
{
    "title": "Dr. Seuss' The Grinch",
    "url": "https://www.rottentomatoes.com/m/the_grinch",
    "review": "Overall The Grinch suffers the curse experienced by many films, in that it is good and entertaining but ultimately only ‘good enough‘ or ‘reasonably entertaining’. Jokes land generally well, but softly.",
    "sentiment": "POSITIVE"
},
{
    "title": "Dr. Seuss' The Grinch",
    "url": "https://www.rottentomatoes.com/m/the_grinch",
    "review": "Pandering to audiences with modern songs and obvious punchlines galore\n\nDon’t they know that these are tricks people will come to abhor?",
    "sentiment": "NEGATIVE"
},
{
    "title": "Dr. Seuss' The Grinch",
    "url": "https://www.rottentomatoes.com/m/the_grinch",
    "review": "While there isn't much new added to the formula, The Grinch is a sentimental update of a well-known story that leaves a warm glow and is sure to make families happy during the festive season.",
    "sentiment": "POSITIVE"
},
{
    "title": "Civil War",
    "url": "https://www.rottentomatoes.com/m/civil_war_2024",
    "review": "This violent tale of anaesthetised reporters is just a war yarn with a twist.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Civil War",
    "url": "https://www.rottentomatoes.com/m/civil_war_2024",
    "review": "There’s a cautionary message then in the madness: stop or perish; the choice is entirely ours.",
    "sentiment": "POSITIVE"
},
{
    "title": "Civil War",
    "url": "https://www.rottentomatoes.com/m/civil_war_2024",
    "review": "In Alex Garland's tense film, journalists risk everything to document the US at war with itself.",
    "sentiment": "POSITIVE"
},
{
    "title": "Civil War",
    "url": "https://www.rottentomatoes.com/m/civil_war_2024",
    "review": "Civil War is not a film about why extreme division happens; it’s about the personal impact of division at its worst.",
    "sentiment": "POSITIVE"
},
{
    "title": "Civil War",
    "url": "https://www.rottentomatoes.com/m/civil_war_2024",
    "review": "A staggering and frequently brilliant film looking at a hopefully just fictionalized version of America destroying itself from within.",
    "sentiment": "POSITIVE"
},
{
    "title": "Civil War",
    "url": "https://www.rottentomatoes.com/m/civil_war_2024",
    "review": "Garland seems poised to be make political points, to show how our current political dysfunction could lead to something far worse… but he never follows through.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Blink",
    "url": "https://www.rottentomatoes.com/m/blink_2024_2",
    "review": "A really interesting and uplifting film about people facing adversity and the triumph of love over despair.",
    "sentiment": "POSITIVE"
},
{
    "title": "Blink",
    "url": "https://www.rottentomatoes.com/m/blink_2024_2",
    "review": "The slow drip of sanctification, forced down with an especially saccharine score, may be enough to make some viewers go off the film and even the subjects themselves as they enjoy the dream holiday of a lifetime.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Blink",
    "url": "https://www.rottentomatoes.com/m/blink_2024_2",
    "review": "I was deeply moved by this documentary... It's not just a travelogue but a profound statement about seizing the day.",
    "sentiment": "POSITIVE"
},
{
    "title": "Blink",
    "url": "https://www.rottentomatoes.com/m/blink_2024_2",
    "review": "At feature length, the journey grows a little bland - something of a vacation slideshow, strung together by inspirational homilies - but the family make fine company and their story is well worth engaging with.",
    "sentiment": "POSITIVE"
},
{
    "title": "Blink",
    "url": "https://www.rottentomatoes.com/m/blink_2024_2",
    "review": "A really inspired premise, beautifully told... [But] it left me with some questions.",
    "sentiment": "POSITIVE"
},
{
    "title": "Blink",
    "url": "https://www.rottentomatoes.com/m/blink_2024_2",
    "review": "A quaint travel documentary that never quite feels more than slight.",
    "sentiment": "POSITIVE"
},
{
    "title": "Mary",
    "url": "https://www.rottentomatoes.com/m/mary_2024",
    "review": "Vidor brings a humane yet grounded aura to Anne, one that feels lived.",
    "sentiment": "POSITIVE"
},
{
    "title": "Mary",
    "url": "https://www.rottentomatoes.com/m/mary_2024",
    "review": "What we get here is no more real than a Hallmark card, except that it’s a different kind of Hallmark card, one in which Mary has to jump off a roof to escape a burning building and Joseph (Ido Tako) gets into sword fights.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Mary",
    "url": "https://www.rottentomatoes.com/m/mary_2024",
    "review": "The results aren’t disrespectful, just a hodge-podge, a sort of overly reverent sword-and-sandals epic rich in awe-struck characters, Luciferian mischief and historical opportunism.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Mary",
    "url": "https://www.rottentomatoes.com/m/mary_2024",
    "review": "Likely fearing a stumble into the deep end of Lake Blasphemy, Caruso errs on the side of humorlessness, which pushes proceedings into the realm of overbaked melodrama.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Mary",
    "url": "https://www.rottentomatoes.com/m/mary_2024",
    "review": "The changes they made to the story were intriguing and drew me in. Something different for this holiday season",
    "sentiment": "POSITIVE"
},
{
    "title": "Mary",
    "url": "https://www.rottentomatoes.com/m/mary_2024",
    "review": "The movie prioritizes spectacle over depth. [Full review in Spanish]",
    "sentiment": "NEGATIVE"
},
{
    "title": "Love Actually",
    "url": "https://www.rottentomatoes.com/m/love_actually",
    "review": "A cringe 10 for the price of one bulk holiday sale of the most well-worn rom-com tropes.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Love Actually",
    "url": "https://www.rottentomatoes.com/m/love_actually",
    "review": "Love Actually provides enough happy endings to make the audience forget that romance and Christmas miracles don't always work out.",
    "sentiment": "POSITIVE"
},
{
    "title": "Love Actually",
    "url": "https://www.rottentomatoes.com/m/love_actually",
    "review": "The tagline for Love Actually is \"The Ultimate Romantic Comedy.\" Perhaps. But not in the sense the producers intended.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Love Actually",
    "url": "https://www.rottentomatoes.com/m/love_actually",
    "review": "Love Actually is for the hopeless romantics and idealists of this world, but those just looking for a warm and comfortably predictable experience should enjoy the movie too.",
    "sentiment": "POSITIVE"
},
{
    "title": "Love Actually",
    "url": "https://www.rottentomatoes.com/m/love_actually",
    "review": "The ensemble nature of Love Actually has always drawn audiences into the festivities. Of course, that also means some narratives work and others do not.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Love Actually",
    "url": "https://www.rottentomatoes.com/m/love_actually",
    "review": "Set to the backdrop of Christmas, Love Actually finds believability in the unbelievable, crafting an environment where anything can happen and the greatest risks should be taken.",
    "sentiment": "POSITIVE"
},
{
    "title": "Jingle All the Way",
    "url": "https://www.rottentomatoes.com/m/jingle_all_the_way",
    "review": "That rare family-themed Christmas movie that isn't really aimed at kids. It's actually aimed at adults... It's a family Christmas movie that's completely honest about what family Christmases tend to be like!",
    "sentiment": "POSITIVE"
},
{
    "title": "Jingle All the Way",
    "url": "https://www.rottentomatoes.com/m/jingle_all_the_way",
    "review": "The film is very loud, and festooned with the sort of comic violence far more disturbing than anything in an 18-rated movie.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Jingle All the Way",
    "url": "https://www.rottentomatoes.com/m/jingle_all_the_way",
    "review": "",
    "sentiment": "NEGATIVE"
},
{
    "title": "Jingle All the Way",
    "url": "https://www.rottentomatoes.com/m/jingle_all_the_way",
    "review": "At the end of the day, Jingle All the Way is a holiday classic that kids can take good lessons from, and adults will be able to at least laugh at a bit",
    "sentiment": "POSITIVE"
},
{
    "title": "Jingle All the Way",
    "url": "https://www.rottentomatoes.com/m/jingle_all_the_way",
    "review": "Schwarzenegger's charisma helps somewhat. [Full review in Spanish]",
    "sentiment": "POSITIVE"
},
{
    "title": "Jingle All the Way",
    "url": "https://www.rottentomatoes.com/m/jingle_all_the_way",
    "review": "...the movie benefits substantially from Schwarzenegger's go-for-broke turn as the progressively frantic central character...",
    "sentiment": "POSITIVE"
},
{
    "title": "Rebel Ridge",
    "url": "https://www.rottentomatoes.com/m/rebel_ridge",
    "review": "As elementally satisfying as a great Western.",
    "sentiment": "POSITIVE"
},
{
    "title": "Rebel Ridge",
    "url": "https://www.rottentomatoes.com/m/rebel_ridge",
    "review": "“Rebel Ridge” isn’t up there with Saulnier’s earlier films but it’s still something rare in the commercial movie landscape: A work of pure professionalism behind the camera and in front of it.",
    "sentiment": "POSITIVE"
},
{
    "title": "Rebel Ridge",
    "url": "https://www.rottentomatoes.com/m/rebel_ridge",
    "review": "With a whip-smart plot, a strong lead in Aaron Pierre, and a standout villain in Don Johnson, director Jeremy Saulnier has done it again.",
    "sentiment": "POSITIVE"
},
{
    "title": "Rebel Ridge",
    "url": "https://www.rottentomatoes.com/m/rebel_ridge",
    "review": "Equal parts suspense thriller gathering evidence and action film relying on close-up combat that never threatens deadly force until the finale, Saulnier is always moving us forward with high stakes scenarios that cannot be subdued without a fight.",
    "sentiment": "POSITIVE"
},
{
    "title": "Rebel Ridge",
    "url": "https://www.rottentomatoes.com/m/rebel_ridge",
    "review": "Calling Terry Richmond a thinking man’s John Rambo is apt.",
    "sentiment": "POSITIVE"
},
{
    "title": "Rebel Ridge",
    "url": "https://www.rottentomatoes.com/m/rebel_ridge",
    "review": "Jeremy Saulnier writes and directs this thriller that combines expertly staged action scenes with an intricate plot around police violence and racism in the United States. [Full review in Spanish]",
    "sentiment": "POSITIVE"
},
{
    "title": "Blink Twice",
    "url": "https://www.rottentomatoes.com/m/blink_twice",
    "review": "One of Kravitz’s major accomplishments in the movie is how she and the cinematographer, Adam Newport-Berra, make an island paradise feel like hell on Earth.",
    "sentiment": "POSITIVE"
},
{
    "title": "Blink Twice",
    "url": "https://www.rottentomatoes.com/m/blink_twice",
    "review": "Kravitz has style and good timing, and Ackie is fantastic in the lead, capable of conveying both “cool girl” and absolute eye-bolting horror.",
    "sentiment": "POSITIVE"
},
{
    "title": "Blink Twice",
    "url": "https://www.rottentomatoes.com/m/blink_twice",
    "review": "It has style all over the place... It's well-executed.",
    "sentiment": "POSITIVE"
},
{
    "title": "Blink Twice",
    "url": "https://www.rottentomatoes.com/m/blink_twice",
    "review": "Working from a script that she co-wrote with E.T. Feigenbaum, Kravitz shows a keen visual eye and a master sense of pacing – creating a highly effective, star-studded thriller that is also a razor-sharp social commentary.",
    "sentiment": "POSITIVE"
},
{
    "title": "Blink Twice",
    "url": "https://www.rottentomatoes.com/m/blink_twice",
    "review": "Blink Twice may be a little bit uneven, but it’s not easily forgotten.",
    "sentiment": "POSITIVE"
},
{
    "title": "Blink Twice",
    "url": "https://www.rottentomatoes.com/m/blink_twice",
    "review": "The film’s obsession with forgetting can be read as a commentary on the way we displace culpability for violence onto the poor.",
    "sentiment": "POSITIVE"
},
{
    "title": "Sugarcane",
    "url": "https://www.rottentomatoes.com/m/sugarcane",
    "review": "Kassie and NoiseCat marry rigour with compassion, giving the survivors the platform to talk while understanding that some things are too hard to put into words.",
    "sentiment": "POSITIVE"
},
{
    "title": "Sugarcane",
    "url": "https://www.rottentomatoes.com/m/sugarcane",
    "review": "The damaged, rising community depicted in Sugarland are in no mood for apologies. They want accountability.",
    "sentiment": "POSITIVE"
},
{
    "title": "Sugarcane",
    "url": "https://www.rottentomatoes.com/m/sugarcane",
    "review": "It’s a remarkably courageous and exposed work, particularly for co-director Julian Brave NoiseCat and his father, Ed Archie NoiseCat, whose painful journey together in search of healing is the film’s spine.",
    "sentiment": "POSITIVE"
},
{
    "title": "Sugarcane",
    "url": "https://www.rottentomatoes.com/m/sugarcane",
    "review": "With its blend of documentary styles and its skilful journalistic structure, this is a difficult but remarkably clear-eyed film.",
    "sentiment": "POSITIVE"
},
{
    "title": "Sugarcane",
    "url": "https://www.rottentomatoes.com/m/sugarcane",
    "review": "The atrocities perpetuated upon Canada's indigenous is yet another stain on a Catholic Church which has covered up the sexual crimes of priests around the world and allowed the abuse and deaths of single women in Ireland's notorious Magdalene Laundries.",
    "sentiment": "POSITIVE"
},
{
    "title": "Sugarcane",
    "url": "https://www.rottentomatoes.com/m/sugarcane",
    "review": "It defies more traditional documentary techniques. There are conversations rather than interviews. There is reporting, but no hard findings. It never flinches from horror, but it also knows how to find wonder.",
    "sentiment": "POSITIVE"
},
{
    "title": "Hit Man",
    "url": "https://www.rottentomatoes.com/m/hit_man_2023",
    "review": "A crime romp with a lightness of touch that feels increasingly rare.",
    "sentiment": "POSITIVE"
},
{
    "title": "Hit Man",
    "url": "https://www.rottentomatoes.com/m/hit_man_2023",
    "review": "Based on a profile of Johnson in Texas Monthly magazine, by Skip Hollandsworth, this old-fashioned sexy caper makes merry with unreliable narration, slapstick and the stress of remembering which lie you told.",
    "sentiment": "POSITIVE"
},
{
    "title": "Hit Man",
    "url": "https://www.rottentomatoes.com/m/hit_man_2023",
    "review": "...three different movies but never feels disconnected or disjointed. It transforms into character as effortlessly and entertainingly as Powell does.",
    "sentiment": "POSITIVE"
},
{
    "title": "Hit Man",
    "url": "https://www.rottentomatoes.com/m/hit_man_2023",
    "review": "Richard Linklater and Glen Powell are able to navigate such a tricky tone, mixing screwball comedy antics with sizzling romance and anxiety-shredding crime that teeters into full-blown neo-noir.",
    "sentiment": "POSITIVE"
},
{
    "title": "Hit Man",
    "url": "https://www.rottentomatoes.com/m/hit_man_2023",
    "review": "Hit Man finds the alluring spot between comedy and noir, boosted with a charismatic turn from actor Glen Powell.",
    "sentiment": "POSITIVE"
},
{
    "title": "Hit Man",
    "url": "https://www.rottentomatoes.com/m/hit_man_2023",
    "review": "Truly can’t say enough good things about it as there isn’t any element the film lacked.",
    "sentiment": "POSITIVE"
},
{
    "title": "We Live in Time",
    "url": "https://www.rottentomatoes.com/m/we_live_in_time",
    "review": "Crowley, having nailed his casting, directs with a light hand and follows the emotion through, to good effect. It feels real, and honest, in a way that too few romantic films manage.",
    "sentiment": "POSITIVE"
},
{
    "title": "We Live in Time",
    "url": "https://www.rottentomatoes.com/m/we_live_in_time",
    "review": "A deeply moving and beautifully performed film.",
    "sentiment": "POSITIVE"
},
{
    "title": "We Live in Time",
    "url": "https://www.rottentomatoes.com/m/we_live_in_time",
    "review": "hough Pugh and Garfield (particularly the latter) bring intense, raw emotionality to otherwise by-the-numbers material, We Live in Time is an overall predictable addition to a strangely prevalent romantic subgenre.",
    "sentiment": "NEGATIVE"
},
{
    "title": "We Live in Time",
    "url": "https://www.rottentomatoes.com/m/we_live_in_time",
    "review": "With Bryce Dessner's graceful score and Crowley's sensitive handling also factored in, this fitfully absorbing weepie works best when it gives its emotions room to breathe.",
    "sentiment": "POSITIVE"
},
{
    "title": "We Live in Time",
    "url": "https://www.rottentomatoes.com/m/we_live_in_time",
    "review": "There’s something appealing and impressive about a film that’s this honest and unashamed to be so romantic.",
    "sentiment": "POSITIVE"
},
{
    "title": "We Live in Time",
    "url": "https://www.rottentomatoes.com/m/we_live_in_time",
    "review": "All of human life is here in this film and it’s a joy to watch it flash by your eyes. It might just make you value your own life even more.",
    "sentiment": "POSITIVE"
},
{
    "title": "Spirited",
    "url": "https://www.rottentomatoes.com/m/spirited",
    "review": "It just keeps going, my goodness.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Spirited",
    "url": "https://www.rottentomatoes.com/m/spirited",
    "review": "It’s a funny, bouncy romp with strong singing and dancing talent and just the right touch of snark to please any Scrooge.",
    "sentiment": "POSITIVE"
},
{
    "title": "Spirited",
    "url": "https://www.rottentomatoes.com/m/spirited",
    "review": "There’s a delightfully eccentric song called Good Afternoon that rocks... The rest of the film is a turgid yawn that struggles with its too-high concept.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Spirited",
    "url": "https://www.rottentomatoes.com/m/spirited",
    "review": "The chemistry that Ryan Reynolds and Will Ferrell share feels forced, making their friendship feel phony to the audience, for a film whose main attraction is the bromance.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Spirited",
    "url": "https://www.rottentomatoes.com/m/spirited",
    "review": "Given its 127-minute runtime, “Spirited” could have been even better if director Sean Anders had trimmed some of the self-referential humor and fully embraced the holiday spirit.",
    "sentiment": "POSITIVE"
},
{
    "title": "Spirited",
    "url": "https://www.rottentomatoes.com/m/spirited",
    "review": "While there’s no such thing as too many Christmas Carol adaptations, Apple TV’s Spirited falls a bit short in its emotional heart as it focuses more closely on the music and the comedic beats.",
    "sentiment": "POSITIVE"
},
{
    "title": "Beetlejuice Beetlejuice",
    "url": "https://www.rottentomatoes.com/m/beetlejuice_beetlejuice",
    "review": "Unlike the Ghostbusters reboots, this does have at least some of the charm of the original.",
    "sentiment": "POSITIVE"
},
{
    "title": "Beetlejuice Beetlejuice",
    "url": "https://www.rottentomatoes.com/m/beetlejuice_beetlejuice",
    "review": "Beetlejuice Beetlejuice shines with Burton's striking visual style and dry wit.",
    "sentiment": "POSITIVE"
},
{
    "title": "Beetlejuice Beetlejuice",
    "url": "https://www.rottentomatoes.com/m/beetlejuice_beetlejuice",
    "review": "There’s a resultant clumsiness to it that makes the traditional zaniness of the whole project feel telegraphed.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Beetlejuice Beetlejuice",
    "url": "https://www.rottentomatoes.com/m/beetlejuice_beetlejuice",
    "review": "When I most definitely will run into a drunk guy dressed like Beetlejuice on Halloween, if I ask him to tell me about his night, it will almost certainly be a more interesting story than the one Beetlejuice Beetlejuice tells.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Beetlejuice Beetlejuice",
    "url": "https://www.rottentomatoes.com/m/beetlejuice_beetlejuice",
    "review": "[T]here’s nothing to this movie. It was gossamer, it was a spider web — swipe your hand and it vanishes. ... The final act did pick up, as if the movie had realized it was just puttering around and had to rouse itself and finish big. Too little, too late.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Beetlejuice Beetlejuice",
    "url": "https://www.rottentomatoes.com/m/beetlejuice_beetlejuice",
    "review": "“Beetlejuice Beetlejuice” provides a perfect popcorn movie to escape to in air-conditioned cinemas. It offers deliciously dark and twisted eye candy but not much more.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Separated",
    "url": "https://www.rottentomatoes.com/m/separated",
    "review": "It's illuminating in the most chilling way.",
    "sentiment": "POSITIVE"
},
{
    "title": "Separated",
    "url": "https://www.rottentomatoes.com/m/separated",
    "review": "Still, current events lend the film a power that goes beyond its flaws. The way “Separated” looks back in indignation is now incalculably enhanced by fear for the future, with even more traumatizing measures on the horizon...",
    "sentiment": "POSITIVE"
},
{
    "title": "Separated",
    "url": "https://www.rottentomatoes.com/m/separated",
    "review": "“Separated” is characteristically thorough and eye-opening.",
    "sentiment": "POSITIVE"
},
{
    "title": "Separated",
    "url": "https://www.rottentomatoes.com/m/separated",
    "review": "Kudos to Morris and Soboroff for telling the story, which is hopefully never repeated.",
    "sentiment": "POSITIVE"
},
{
    "title": "Separated",
    "url": "https://www.rottentomatoes.com/m/separated",
    "review": "It’s a hard watch, but not nearly as difficult as the real thing. And since we’ll probably soon be seeing the sequel, which is never as fun as the original, it will most likely be much worse soon. Good times lie ahead, no doubt.",
    "sentiment": "POSITIVE"
},
{
    "title": "Separated",
    "url": "https://www.rottentomatoes.com/m/separated",
    "review": "The saddest thing about Separated — and, in fact, all of Morris’s documentaries about American politics — is not that they’re about something that happened but rather about all the mistakes we’re primed to make again and again and again.",
    "sentiment": "POSITIVE"
},
{
    "title": "Alien: Romulus",
    "url": "https://www.rottentomatoes.com/m/alien_romulus",
    "review": "I thought this was awesome... Yes, it plays the hits, but in a slightly different key. It's different enough for me to have had fun.",
    "sentiment": "POSITIVE"
},
{
    "title": "Alien: Romulus",
    "url": "https://www.rottentomatoes.com/m/alien_romulus",
    "review": "Every possible ingredient has surely been used, every angle exhausted. Major props, then, to Fede Álvarez for cooking up something fresh in this furiously exciting, gnarly seventh entry. He’s even found the eggs, too.",
    "sentiment": "POSITIVE"
},
{
    "title": "Alien: Romulus",
    "url": "https://www.rottentomatoes.com/m/alien_romulus",
    "review": "You can see the gears turning in every scene, and feel the film dutifully avoiding, well, alienation, the unknown, the discomfiting.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Alien: Romulus",
    "url": "https://www.rottentomatoes.com/m/alien_romulus",
    "review": "Totally committed to jump scares, this latest outing for the franchise is a far better film than the recent prequels.",
    "sentiment": "POSITIVE"
},
{
    "title": "Alien: Romulus",
    "url": "https://www.rottentomatoes.com/m/alien_romulus",
    "review": "As blockbuster franchises go, Romulus isn’t a bad film. But it suffers from the perennial blockbuster problem, which is that it doesn’t believe in its own world or its own themes.",
    "sentiment": "POSITIVE"
},
{
    "title": "Alien: Romulus",
    "url": "https://www.rottentomatoes.com/m/alien_romulus",
    "review": "The plot may be one “Alien” cliche after another, but the physical production is solid.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Deadpool & Wolverine",
    "url": "https://www.rottentomatoes.com/m/deadpool_and_wolverine",
    "review": "Cumbersome plotting aside, there’s enough gory mayhem and genuine zingers to make Deadpool & Wolverine a fun ride in a packed and up-for-it cinema.",
    "sentiment": "POSITIVE"
},
{
    "title": "Deadpool & Wolverine",
    "url": "https://www.rottentomatoes.com/m/deadpool_and_wolverine",
    "review": "It’s amusing at times, especially for fans of the MCU as several Marvel superhero movie stars pop up in cameo roles...",
    "sentiment": "POSITIVE"
},
{
    "title": "Deadpool & Wolverine",
    "url": "https://www.rottentomatoes.com/m/deadpool_and_wolverine",
    "review": "Some of the jokes land through sheer volume and force of will, but it feels like you have to endure 40-or-so rectal stabbings for a single juicy zinger.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Deadpool & Wolverine",
    "url": "https://www.rottentomatoes.com/m/deadpool_and_wolverine",
    "review": "If it doesn’t quite feel like a reset for Marvel, the film’s persistent self-awareness nonetheless feels like a love letter to superheroes.",
    "sentiment": "POSITIVE"
},
{
    "title": "Deadpool & Wolverine",
    "url": "https://www.rottentomatoes.com/m/deadpool_and_wolverine",
    "review": "Rather than a smart send-up, the movie functions as a dreary distillation of the worst excesses of the MCU and its apparently endless offshoots.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Deadpool & Wolverine",
    "url": "https://www.rottentomatoes.com/m/deadpool_and_wolverine",
    "review": "Deadpool & Wolverine is less a long string of crass gags and bloody gore and more a celebration of the FOX era of Marvel films, mixed with amusing set pieces and lots of trademark fourth wall breaking gags. Not for everyone, but I enjoyed it!",
    "sentiment": "POSITIVE"
},
{
    "title": "Our Little Secret",
    "url": "https://www.rottentomatoes.com/m/our_little_secret",
    "review": "Under the shiny Netflix-feature-film-budget gift wrapping, you won’t find much in Our Little Secret to feel grateful for.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Our Little Secret",
    "url": "https://www.rottentomatoes.com/m/our_little_secret",
    "review": "A typically formulaic seasonal sugar rush that’s only blandly mediocre, rather than so-bad-it’s-good. But Lindsay Lohan’s romcom-dominance cannot be denied.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Our Little Secret",
    "url": "https://www.rottentomatoes.com/m/our_little_secret",
    "review": "It inspires no emotional investment, it has no interesting characters, offers zero chemistry between the stars and not the slightest bit of a reason to be anything but bored.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Our Little Secret",
    "url": "https://www.rottentomatoes.com/m/our_little_secret",
    "review": "It’s not the screwiest of screwball comedy complications. Instead it’s lame, tame and dated.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Our Little Secret",
    "url": "https://www.rottentomatoes.com/m/our_little_secret",
    "review": "Lindsey Lohan is back and here is another Christmas rom-com to prove it.",
    "sentiment": "POSITIVE"
},
{
    "title": "Our Little Secret",
    "url": "https://www.rottentomatoes.com/m/our_little_secret",
    "review": "…familiar faces, silly situations, moral lessons learned and cheerful resolution. Lindsay Lohan's Our Little Secret is the kind of lightweight, frothy film that you just don’t see in cinemas anymore... ideal fodder for a festive Netflix and chill session.",
    "sentiment": "POSITIVE"
},
{
    "title": "National Lampoon's Christmas Vacation",
    "url": "https://www.rottentomatoes.com/m/national_lampoons_christmas_vacation",
    "review": "If it doesn't make you at least giggle, then you clearly don't understand the true meaning of the festive season.",
    "sentiment": "POSITIVE"
},
{
    "title": "National Lampoon's Christmas Vacation",
    "url": "https://www.rottentomatoes.com/m/national_lampoons_christmas_vacation",
    "review": "Sure, it's crude, episodic and half the jokes don't work, but 'Christmas Vacation' may be the only modern Christmas comedy which really stands up to repeat viewings.",
    "sentiment": "POSITIVE"
},
{
    "title": "National Lampoon's Christmas Vacation",
    "url": "https://www.rottentomatoes.com/m/national_lampoons_christmas_vacation",
    "review": "Chase's befuddled Dad remains a genuinely amusing creation, and the sight gags are impeccably timed.",
    "sentiment": "POSITIVE"
},
{
    "title": "National Lampoon's Christmas Vacation",
    "url": "https://www.rottentomatoes.com/m/national_lampoons_christmas_vacation",
    "review": "A goofy satire of the middle-class WASP suburban holiday scene.",
    "sentiment": "POSITIVE"
},
{
    "title": "National Lampoon's Christmas Vacation",
    "url": "https://www.rottentomatoes.com/m/national_lampoons_christmas_vacation",
    "review": "It really delivers on the laughs. One of the best holiday comedies ever made",
    "sentiment": "POSITIVE"
},
{
    "title": "National Lampoon's Christmas Vacation",
    "url": "https://www.rottentomatoes.com/m/national_lampoons_christmas_vacation",
    "review": "From the wacky mishaps to oddly endearing characters, Christmas Vacation remains an uproarious, feel-good, oft-quoted holiday classic. Over 35 years, the film has become an annual must-watch for a fun, old-fashioned family Christmas.",
    "sentiment": "POSITIVE"
},
{
    "title": "Terrifier 3",
    "url": "https://www.rottentomatoes.com/m/terrifier_3",
    "review": "Leone’s talent for tone control and his ability to shift from...chaotic, blood-soaked joy into a horrifying, blood-soaked hopelessness...makes Terrifier 3 work as more than a special effects exhibition.",
    "sentiment": "POSITIVE"
},
{
    "title": "Terrifier 3",
    "url": "https://www.rottentomatoes.com/m/terrifier_3",
    "review": "Rarely has so much on-screen bloodshed been so lifeless.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Terrifier 3",
    "url": "https://www.rottentomatoes.com/m/terrifier_3",
    "review": "It's really kind of a lot of fun.",
    "sentiment": "POSITIVE"
},
{
    "title": "Terrifier 3",
    "url": "https://www.rottentomatoes.com/m/terrifier_3",
    "review": "Wonderfully gross, disturbing, dark and hilarious for any fan of slasher movies.",
    "sentiment": "POSITIVE"
},
{
    "title": "Terrifier 3",
    "url": "https://www.rottentomatoes.com/m/terrifier_3",
    "review": "Terrifier 3 does not disappoint. It is bloody and bold and bloody and silly and bloody – did I mention it was bloody?",
    "sentiment": "POSITIVE"
},
{
    "title": "Terrifier 3",
    "url": "https://www.rottentomatoes.com/m/terrifier_3",
    "review": "If you can imagine, it’s even more depraved, sadistic and just plain wrong. No one is spared: families, kids, lovers – all at the hands of a silent creature that finds absolute joy in others’ pain – and now in a Santa suit most of the time.",
    "sentiment": "POSITIVE"
},
{
    "title": "Y2K",
    "url": "https://www.rottentomatoes.com/m/y2k_2024",
    "review": "... A series of references to Surge soda, Tae Bo, dial-up sounds and Nintendo 64 does not a movie make.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Y2K",
    "url": "https://www.rottentomatoes.com/m/y2k_2024",
    "review": "This scattershot, blood-drenched comedy of cybernetic terrors frequently loses connection. Like the promising early days of the internet, its only lasting legacy will likely be one smothered in disappointment and missed opportunity.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Y2K",
    "url": "https://www.rottentomatoes.com/m/y2k_2024",
    "review": "... The carnage of consumer goods is nasty, gory and cruel, with a darkly comic mean streak that recalls Joe Dante’s “Gremlins.”",
    "sentiment": "POSITIVE"
},
{
    "title": "Y2K",
    "url": "https://www.rottentomatoes.com/m/y2k_2024",
    "review": "Kyle Mooney's high-concept and nostalgia-heavy apocalyptic horror comedy is a mixed bag.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Y2K",
    "url": "https://www.rottentomatoes.com/m/y2k_2024",
    "review": "Y2K fails to weave its references or callbacks into a coherent narrative, feeling like a series of disconnected sketches rather than a fully realized film.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Y2K",
    "url": "https://www.rottentomatoes.com/m/y2k_2024",
    "review": "Y2K has good intentions but never quite sticks the landing. This story just doesn’t come together, and the coming-of-age comedy is inconsistent... The horror-centric comedic bits are rock solid, and there are (at least) a few fun character interactions.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Cuckoo",
    "url": "https://www.rottentomatoes.com/m/cuckoo_2024",
    "review": "It's not very developed, so we don't get invested in their scary shenanigans.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Cuckoo",
    "url": "https://www.rottentomatoes.com/m/cuckoo_2024",
    "review": "Amid unsettling sound design and plotting that is in every sense loopy, questions are raised about nature and nurture, and about human bonds that go beyond the conventional norms of genetics and biology.",
    "sentiment": "POSITIVE"
},
{
    "title": "Cuckoo",
    "url": "https://www.rottentomatoes.com/m/cuckoo_2024",
    "review": "Cuckoo emerges slightly less than the sum of its parts. But it completes the hat-trick on Dan Stevens' wildest yer.",
    "sentiment": "POSITIVE"
},
{
    "title": "Cuckoo",
    "url": "https://www.rottentomatoes.com/m/cuckoo_2024",
    "review": "It’s fascinating in fits and starts, but more often tedious or frustrating – and stubbornly insists to be any fun whatsoever.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Cuckoo",
    "url": "https://www.rottentomatoes.com/m/cuckoo_2024",
    "review": "Cuckoo's revels in its own weirdness, but it's all grounded by Hunter Schafer's committed performance.",
    "sentiment": "POSITIVE"
},
{
    "title": "Cuckoo",
    "url": "https://www.rottentomatoes.com/m/cuckoo_2024",
    "review": "Featuring homages aplenty, several tense sequences, a butch lesbian romance, and a few perplexing mysteries, Cuckoo stands out by being completely different from anything else we saw in 2024.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Wild Robot",
    "url": "https://www.rottentomatoes.com/m/the_wild_robot",
    "review": "Lupita Nyong'o is doing fantastic voice work here. The whole cast is great.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Wild Robot",
    "url": "https://www.rottentomatoes.com/m/the_wild_robot",
    "review": "It’s sentimental stuff, certainly, but the picture’s unexpectedly dark humour outweighs any maudlin tendencies.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Wild Robot",
    "url": "https://www.rottentomatoes.com/m/the_wild_robot",
    "review": "It's got lots of lovely life lessons.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Wild Robot",
    "url": "https://www.rottentomatoes.com/m/the_wild_robot",
    "review": "Few films have the power to evoke such strong emotions, and 'The Wild Robot' is a treasure trove of valuable life lessons for everyone.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Wild Robot",
    "url": "https://www.rottentomatoes.com/m/the_wild_robot",
    "review": "Add themes on home and family of the nurture rather than nature variety and there's a lot to love about Roz and company's emotional evolutions. It's the blueprint of a civilization born from chaos.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Wild Robot",
    "url": "https://www.rottentomatoes.com/m/the_wild_robot",
    "review": "The film mines a lot of clichés but manages to do something a little different with them, blending traditional elements of children’s fiction with a distinctly 21st Century sensibility.",
    "sentiment": "POSITIVE"
},
{
    "title": "Speak No Evil",
    "url": "https://www.rottentomatoes.com/m/speak_no_evil_2024",
    "review": "As a fan of the original, I really think this did it justice and added a new twist and made its own film.",
    "sentiment": "POSITIVE"
},
{
    "title": "Speak No Evil",
    "url": "https://www.rottentomatoes.com/m/speak_no_evil_2024",
    "review": "If you've never savored the blood and bite of a steak, this processed remake will probably serve just fine.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Speak No Evil",
    "url": "https://www.rottentomatoes.com/m/speak_no_evil_2024",
    "review": "Speak No Evil eventually goes full-on with the familiar horror movie blood-spattering, but the social satire in that well-executed build-up is the real strength of the film.",
    "sentiment": "POSITIVE"
},
{
    "title": "Speak No Evil",
    "url": "https://www.rottentomatoes.com/m/speak_no_evil_2024",
    "review": "Speak No Evil is in no way a bad film, but it is another example of diluting a narrative to unnecessarily coddle your audience.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Speak No Evil",
    "url": "https://www.rottentomatoes.com/m/speak_no_evil_2024",
    "review": "I would recommend seeing the superior and more disturbing Danish version rather than this Hollywood-like version.",
    "sentiment": "POSITIVE"
},
{
    "title": "Speak No Evil",
    "url": "https://www.rottentomatoes.com/m/speak_no_evil_2024",
    "review": "Star James McAvoy rules in flawed but irresistible genre remake.",
    "sentiment": "POSITIVE"
},
{
    "title": "Nutcrackers",
    "url": "https://www.rottentomatoes.com/m/nutcrackers",
    "review": "What Green adds to familiar material is a sense of genuine wildness—and, at times, eerie ritual. He recognizes something tribal about the raising of close siblings, and their near-feral nature adds jolts of humor and, eventually, heartbreak.",
    "sentiment": "POSITIVE"
},
{
    "title": "Nutcrackers",
    "url": "https://www.rottentomatoes.com/m/nutcrackers",
    "review": "It’s not really a family film, at least not for many families — the home-school lesson tells you why — but it’s not really a grown-up comedy either. It hovers in an uncanny valley, and the tonal swing is unpleasant.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Nutcrackers",
    "url": "https://www.rottentomatoes.com/m/nutcrackers",
    "review": "Stiller has become a deeper actor with age, and he's perfect here: you know he has a good soul, because this is a comedy, and not a dark one, but he keeps you guessing.",
    "sentiment": "POSITIVE"
},
{
    "title": "Nutcrackers",
    "url": "https://www.rottentomatoes.com/m/nutcrackers",
    "review": "David Gordon Green directs with a measured touch that allows the gang's relationship to evolve with some naturalism.",
    "sentiment": "POSITIVE"
},
{
    "title": "Nutcrackers",
    "url": "https://www.rottentomatoes.com/m/nutcrackers",
    "review": "Nutcrackers is effective as a cinematographic proposal, it follows the expected family formula, although without offering any new perspective on the theme. [Full review in Spanish]",
    "sentiment": "POSITIVE"
},
{
    "title": "Nutcrackers",
    "url": "https://www.rottentomatoes.com/m/nutcrackers",
    "review": "It’s sweet, a little unusual, and there’s just enough of an indie film vibe to understand why Stiller and Cardellini signed on.",
    "sentiment": "POSITIVE"
},
{
    "title": "Smile 2",
    "url": "https://www.rottentomatoes.com/m/smile_2",
    "review": "The special effects are bracingly revolting, the malevolent smiles as creepy as ever. And the film has the added bonus of some killer choreography, in every sense of the word.",
    "sentiment": "POSITIVE"
},
{
    "title": "Smile 2",
    "url": "https://www.rottentomatoes.com/m/smile_2",
    "review": "While I’m sure I’ll again be in the minority, for all of its obvious strengths, and just like its predecessor, Smile 2 made me angry, and that’s all there is to say.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Smile 2",
    "url": "https://www.rottentomatoes.com/m/smile_2",
    "review": "This is the rare case of a horror sequel that is better than the original.",
    "sentiment": "POSITIVE"
},
{
    "title": "Smile 2",
    "url": "https://www.rottentomatoes.com/m/smile_2",
    "review": "For the most part, Smile 2 is just a carbon copy of its predecessor, repeating the same beats and scares but with an increased budget.",
    "sentiment": "POSITIVE"
},
{
    "title": "Smile 2",
    "url": "https://www.rottentomatoes.com/m/smile_2",
    "review": "The sequel has many of the same issues as its predecessor, but Parker Finn (with help from Naomi Scott) so over-delivers on cinematic razzle dazzle that it barely matters.",
    "sentiment": "POSITIVE"
},
{
    "title": "Smile 2",
    "url": "https://www.rottentomatoes.com/m/smile_2",
    "review": "A relentless, brittle, and brutally-funny splice of psychological and supernatural horror, and with Scott center stage, it’s anything but predictable.",
    "sentiment": "POSITIVE"
},
{
    "title": "How the Grinch Stole Christmas",
    "url": "https://www.rottentomatoes.com/m/how_the_grinch_stole_christmas",
    "review": "Director Ron Howard aims for the beautifully stylized mayhem of Frank Tashlin and Tim Burton, but he comes closer to the clamorous, headache-inducing visual overkill of Joel Schumacher's Batman movies.",
    "sentiment": "NEGATIVE"
},
{
    "title": "How the Grinch Stole Christmas",
    "url": "https://www.rottentomatoes.com/m/how_the_grinch_stole_christmas",
    "review": "Director Ron Howard usually lets his comedies gestate organically, but his Grinch is frantic from start to finish.",
    "sentiment": "NEGATIVE"
},
{
    "title": "How the Grinch Stole Christmas",
    "url": "https://www.rottentomatoes.com/m/how_the_grinch_stole_christmas",
    "review": "Live-action version of classic has some crude, scary moments.",
    "sentiment": "POSITIVE"
},
{
    "title": "How the Grinch Stole Christmas",
    "url": "https://www.rottentomatoes.com/m/how_the_grinch_stole_christmas",
    "review": "To this day, How the Grinch Stole Christmas stands as one of the most inspired and truly magical holiday texts.",
    "sentiment": "POSITIVE"
},
{
    "title": "How the Grinch Stole Christmas",
    "url": "https://www.rottentomatoes.com/m/how_the_grinch_stole_christmas",
    "review": "With a little more polish and a lot more restraint this could have been a holiday treat. Instead it’s a repetitive and sometimes laborious exercise...",
    "sentiment": "NEGATIVE"
},
{
    "title": "How the Grinch Stole Christmas",
    "url": "https://www.rottentomatoes.com/m/how_the_grinch_stole_christmas",
    "review": "Gaspar Noe by means of Lars von Trier with John Waters, David Lynch, Harmony Korine, Nicolas Winding Refn, Bobcat Goldthwait, Rob Zombie, Darren Aronofsky, Uwe Boll, the Farrellys and Tim Story serving as creative consultants.",
    "sentiment": "POSITIVE"
},
{
    "title": "Elf",
    "url": "https://www.rottentomatoes.com/m/elf",
    "review": "Elf's hopeful and uplifting response to post-9/11 cynicism is gentle, right up to a climax where the world is huddled around their television sets watching news reports trying to figure out what's that thing that crashed in New York City.",
    "sentiment": "POSITIVE"
},
{
    "title": "Elf",
    "url": "https://www.rottentomatoes.com/m/elf",
    "review": "It’s not just the lines, written by David Berenbaum, that work... It’s Ferrell’s bullish commitment to the concept that holds the Jon Favreau-directed film together.",
    "sentiment": "POSITIVE"
},
{
    "title": "Elf",
    "url": "https://www.rottentomatoes.com/m/elf",
    "review": "While his plotting may leave a little to be desired, Favreau directs with speed, humour and efficiency.",
    "sentiment": "POSITIVE"
},
{
    "title": "Elf",
    "url": "https://www.rottentomatoes.com/m/elf",
    "review": "Even if Elf might be a bit overplayed during the holiday season, Ferrell’s puppy-like enthusiasm has kept this film fresh even after all these years.",
    "sentiment": "POSITIVE"
},
{
    "title": "Elf",
    "url": "https://www.rottentomatoes.com/m/elf",
    "review": "Elf isn’t a pre-fabricated piece of synthetic Christmas cheer like such junk as Deck the Halls, Jingle All the Way or the worst-of-the-worst Christmas With the Kranks.",
    "sentiment": "POSITIVE"
},
{
    "title": "Elf",
    "url": "https://www.rottentomatoes.com/m/elf",
    "review": "Just not in time for the holidays, a recent revisit with the surprise Christmas classic earns a smidgen more love from our resident crusty curmudgeon.",
    "sentiment": "POSITIVE"
},
{
    "title": "28 Days Later",
    "url": "https://www.rottentomatoes.com/m/28_days_later",
    "review": "Twenty-eight Days Later is a zombie flick, which makes it my kind of movie-dare I say, our kind of movie. No cinema zombie ever shambles into view without its agenda.",
    "sentiment": "POSITIVE"
},
{
    "title": "28 Days Later",
    "url": "https://www.rottentomatoes.com/m/28_days_later",
    "review": "The possibility of renewal suggested by the survivors' attempts to start over certainly points toward hope. However, the circularity of the movie's plot is most likely to inspire dismay.",
    "sentiment": "NEGATIVE"
},
{
    "title": "28 Days Later",
    "url": "https://www.rottentomatoes.com/m/28_days_later",
    "review": "The best purely British horror/science-fiction film in decades. And the first great apocalypse movie of the new millennium.",
    "sentiment": "POSITIVE"
},
{
    "title": "28 Days Later",
    "url": "https://www.rottentomatoes.com/m/28_days_later",
    "review": "28 Days Later is one of the most influential horror films of the 21st century. [Full review in Spanish]",
    "sentiment": "POSITIVE"
},
{
    "title": "28 Days Later",
    "url": "https://www.rottentomatoes.com/m/28_days_later",
    "review": "Many films since have used ideas from 28 Days Later, and it has entered the collective consciousness as one of the great horror classics of the early '00s.",
    "sentiment": "POSITIVE"
},
{
    "title": "28 Days Later",
    "url": "https://www.rottentomatoes.com/m/28_days_later",
    "review": "Manages to both pay respects to the zombie genre while entirely upending everything you expected from such outings, managing to be frightening throughout its run time, thanks in large part to the core cast.",
    "sentiment": "POSITIVE"
},
{
    "title": "Hot Frosty",
    "url": "https://www.rottentomatoes.com/m/hot_frosty",
    "review": "There's a sincere pleasure in slipping down the ludicrous slide that is Hot Frosty's premise, in which a hot, naive, but very sweet man is the perfect Christmas wish — for Kathy and for any of us who may need a bit of comfort from a cold, cold world.",
    "sentiment": "POSITIVE"
},
{
    "title": "Hot Frosty",
    "url": "https://www.rottentomatoes.com/m/hot_frosty",
    "review": "Each new idea is worse than the last. And there’s nothing particularly snowman-y about Jack except he can’t get too warm or he’ll die, and he snacks on ice cubes.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Hot Frosty",
    "url": "https://www.rottentomatoes.com/m/hot_frosty",
    "review": "With so-so performances and an immensely dumb conceit, this is snow Christmas classic. Still, it’s less naughty, more ice than we might have expected.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Hot Frosty",
    "url": "https://www.rottentomatoes.com/m/hot_frosty",
    "review": "…leave your objectification anxiety at the door, as a thirst trap for desperate house-wives of all sexes, Hot Frosty passes muster as innocuous holiday fun, a product of the Netflix division making bland Hallmark movies with slightly saltier personnel.",
    "sentiment": "POSITIVE"
},
{
    "title": "Hot Frosty",
    "url": "https://www.rottentomatoes.com/m/hot_frosty",
    "review": "This film is not good. Yet it somehow has enough charm to be slightly entertaining.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Hot Frosty",
    "url": "https://www.rottentomatoes.com/m/hot_frosty",
    "review": "This is an absurd movie that you can't take your eyes off. It felt like all of the actors were in different films with Craig Robinson being the most enjoyable out of the bunch.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Die Hard",
    "url": "https://www.rottentomatoes.com/m/die_hard",
    "review": "That’s right, I’m saying it, loudly and proudly, since John McTiernan’s 1988 action classic isn’t just set at Christmastime—it embodies the very spirit of the holiday.",
    "sentiment": "POSITIVE"
},
{
    "title": "Die Hard",
    "url": "https://www.rottentomatoes.com/m/die_hard",
    "review": "It's a glorious scene-stealer for Alan Rickman, though it's a credit to Willis's cheeky charisma that his scene is not in fact stolen.",
    "sentiment": "POSITIVE"
},
{
    "title": "Die Hard",
    "url": "https://www.rottentomatoes.com/m/die_hard",
    "review": "Die Hard is film's equivalent of a terrorist attack on your senses, but Willis' intensity and presence push it into guilty pleasure territory.",
    "sentiment": "POSITIVE"
},
{
    "title": "Die Hard",
    "url": "https://www.rottentomatoes.com/m/die_hard",
    "review": "One of the best Christmas movies ever made. Yes Christmas movies...",
    "sentiment": "POSITIVE"
},
{
    "title": "Die Hard",
    "url": "https://www.rottentomatoes.com/m/die_hard",
    "review": "Nothing lasts forever... except for this cinematic party that keeps welcoming us to one of the best action and christmas movies ever. \n[Full Review in Spanish]",
    "sentiment": "POSITIVE"
},
{
    "title": "Die Hard",
    "url": "https://www.rottentomatoes.com/m/die_hard",
    "review": "One of the most divisive holiday classics, the argument on whether John McTiernan's Die Hard is a Christmas movie, finds its way to the forefront every year. For myself, the truth is indisputable. Die Hard is a Christmas film - no, a Christmas classic.",
    "sentiment": "POSITIVE"
},
{
    "title": "Emilia Pérez",
    "url": "https://www.rottentomatoes.com/m/emilia_perez",
    "review": "Phrases like “game-changer” and “cutting-edge” can’t capture just how audacious and original Emilia Pérez is. It's a knockout.",
    "sentiment": "POSITIVE"
},
{
    "title": "Emilia Pérez",
    "url": "https://www.rottentomatoes.com/m/emilia_perez",
    "review": "On paper, the story sounds like a mashup of Dog Day Afternoon, Sicario, M Butterfly, and Mrs. Doubfire, which really should not work. The fact that it does, is a testament to the audacity of the production and Karla Sofía Gascón.",
    "sentiment": "POSITIVE"
},
{
    "title": "Emilia Pérez",
    "url": "https://www.rottentomatoes.com/m/emilia_perez",
    "review": "Audiard has created Emilia to startle and divert, but it’s Gascón’s performance that centers and grounds the story, and it’s the actress who finally gives the movie real stakes. She is its heart and soul both.",
    "sentiment": "POSITIVE"
},
{
    "title": "Emilia Pérez",
    "url": "https://www.rottentomatoes.com/m/emilia_perez",
    "review": "The ludicrousness of this film is not to be mistaken for originality, there is not an iota of heart in this mess of a musical.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Emilia Pérez",
    "url": "https://www.rottentomatoes.com/m/emilia_perez",
    "review": "I don't always hate it as a musical, but on the whole this is a film that is fundamentally misguided in its approach and fails to realize its characters in any meaningful way.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Emilia Pérez",
    "url": "https://www.rottentomatoes.com/m/emilia_perez",
    "review": "No amount of acting, dancing, or singing on screen will make up for the fact that Emilia Pérez is dangerous for transgender representation.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Longlegs",
    "url": "https://www.rottentomatoes.com/m/longlegs",
    "review": "Longlegs has the ability to make the banal suddenly and delightfully sinister.",
    "sentiment": "POSITIVE"
},
{
    "title": "Longlegs",
    "url": "https://www.rottentomatoes.com/m/longlegs",
    "review": "Longlegs' unsolved serial killer case is hugely unnerving. And where things land? I’ve never seen anything quite like it. Longlegs also continues to highlight that Maika Monroe is one of the very best horror headliners we have.",
    "sentiment": "POSITIVE"
},
{
    "title": "Longlegs",
    "url": "https://www.rottentomatoes.com/m/longlegs",
    "review": "Genuinely and properly upsetting.",
    "sentiment": "POSITIVE"
},
{
    "title": "Longlegs",
    "url": "https://www.rottentomatoes.com/m/longlegs",
    "review": "Perkins’ contract with us seems to be: I’ll give you a hundred minutes of unsettling creepiness, but in return you have to accept one of the dumbest denouements a horror story has ever posited.  And one of Nicolas Cage’s most outlandish performances.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Longlegs",
    "url": "https://www.rottentomatoes.com/m/longlegs",
    "review": "Produced through Nicholas Cage's Saturn Films company, this is a movie whose quality transcends its low budget, partly because of some strong performances.",
    "sentiment": "POSITIVE"
},
{
    "title": "Longlegs",
    "url": "https://www.rottentomatoes.com/m/longlegs",
    "review": "\"I was connecting dots that I don't think that I should've because of all the added details didn't make much sense in the end\"",
    "sentiment": "POSITIVE"
},
{
    "title": "Interstellar",
    "url": "https://www.rottentomatoes.com/m/interstellar_2014",
    "review": "[A] gorgeous, heartbreaking epic.",
    "sentiment": "POSITIVE"
},
{
    "title": "Interstellar",
    "url": "https://www.rottentomatoes.com/m/interstellar_2014",
    "review": "Staggeringly beautiful, bafflingly complex, this is proper event cinema.",
    "sentiment": "POSITIVE"
},
{
    "title": "Interstellar",
    "url": "https://www.rottentomatoes.com/m/interstellar_2014",
    "review": "With all the rampant think pieces questioning the probability of every science fiction film that comes out, it's comforting to across a movie that doesn't really claim to have any of the answers.",
    "sentiment": "POSITIVE"
},
{
    "title": "Interstellar",
    "url": "https://www.rottentomatoes.com/m/interstellar_2014",
    "review": "Humbling and epic in scope, designed and conceptualised brilliantly, but a tad too stand-off-ish emotionally. While the father-daughter dynamic works in parts, the Cooper–Brand relationship is never given the right treatment and collapses.",
    "sentiment": "POSITIVE"
},
{
    "title": "Interstellar",
    "url": "https://www.rottentomatoes.com/m/interstellar_2014",
    "review": "This is a film where complex concepts of quantum physics and powerful human emotions are inextricably intertwined and the ghost that haunts the farmhouse has both a scientific explanation and a sense of supernatural power.",
    "sentiment": "POSITIVE"
},
{
    "title": "Interstellar",
    "url": "https://www.rottentomatoes.com/m/interstellar_2014",
    "review": "\"Interstellar\" pushes the limits for personal interpretation of both science and fiction. Both elements are wildly heightened to a bold scale to address the internal opposites between logic and spectacle, science and sentiment, and brains and emotion.",
    "sentiment": "POSITIVE"
},
{
    "title": "Tangerine",
    "url": "https://www.rottentomatoes.com/m/tangerine_2015",
    "review": "Their bond is largely what transforms another depressing Christmas in LA into a riotous adventure, even as it includes brothels, infidelity, meth, and kidnapping.",
    "sentiment": "POSITIVE"
},
{
    "title": "Tangerine",
    "url": "https://www.rottentomatoes.com/m/tangerine_2015",
    "review": "I enjoyed it... But the way it's set up, how it's shot, the progression of the plot - it's clear that it is offering up the story to a mostly white, bougie audience. It was voyeuristic in the worst possible way.",
    "sentiment": "POSITIVE"
},
{
    "title": "Tangerine",
    "url": "https://www.rottentomatoes.com/m/tangerine_2015",
    "review": "Most of the movie's slow-burning heat comes from Mya Taylor's amazingly deep and deliberate - and often uproariously comedic - performance as Alexandra",
    "sentiment": "POSITIVE"
},
{
    "title": "Tangerine",
    "url": "https://www.rottentomatoes.com/m/tangerine_2015",
    "review": "Baker’s film is a heartfelt rush to the head that extends across racial, sexual, gender and social boundaries.",
    "sentiment": "POSITIVE"
},
{
    "title": "Tangerine",
    "url": "https://www.rottentomatoes.com/m/tangerine_2015",
    "review": "Tangerine unostentatiously celebrates fluidity, community, support and is generally quite hearteningly right-on...",
    "sentiment": "POSITIVE"
},
{
    "title": "Tangerine",
    "url": "https://www.rottentomatoes.com/m/tangerine_2015",
    "review": "From a technical standard point, Tangerine is a marvel. Baker’s filmmaking style pioneered modern indie film-making.",
    "sentiment": "POSITIVE"
},
{
    "title": "Fly Me to the Moon",
    "url": "https://www.rottentomatoes.com/m/fly_me_to_the_moon_2024",
    "review": "Sweet and charming.",
    "sentiment": "POSITIVE"
},
{
    "title": "Fly Me to the Moon",
    "url": "https://www.rottentomatoes.com/m/fly_me_to_the_moon_2024",
    "review": "The space rom-com with Scarlett Johansson and Channing Tatum doesn’t know what it wants to be.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Fly Me to the Moon",
    "url": "https://www.rottentomatoes.com/m/fly_me_to_the_moon_2024",
    "review": "This rom-com about the marketing of the Apollo space program, starring Scarlett Johansson and Channing Tatum, has an inconsistent tone and a vague point of view.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Fly Me to the Moon",
    "url": "https://www.rottentomatoes.com/m/fly_me_to_the_moon_2024",
    "review": "Abort mission!",
    "sentiment": "NEGATIVE"
},
{
    "title": "Fly Me to the Moon",
    "url": "https://www.rottentomatoes.com/m/fly_me_to_the_moon_2024",
    "review": "It’s that thing you want and think we can’t have: entertainment with brains, a comedy with surprise, a love story with guts.",
    "sentiment": "POSITIVE"
},
{
    "title": "Fly Me to the Moon",
    "url": "https://www.rottentomatoes.com/m/fly_me_to_the_moon_2024",
    "review": "‘…a very old-fashioned film, but all the better for keeping things light…plays out in an endearingly silly way, but it’s chipper, personable quality says something good about Johansson and the way she sees her responsibility to entertain her audience…’",
    "sentiment": "POSITIVE"
},
{
    "title": "Klaus",
    "url": "https://www.rottentomatoes.com/m/klaus",
    "review": "The wonderful Rashida Jones voices a teacher who could become a love interest for Jesper. And any movie that casts Norm Macdonald as a cynical boat captain who sounds exactly like Norm MacDdnald is all right by me.",
    "sentiment": "POSITIVE"
},
{
    "title": "Klaus",
    "url": "https://www.rottentomatoes.com/m/klaus",
    "review": "It's awkward and weird, and yet all that awkwardness and weirdness give it personality and charm and a freewheeling, nonsensical quality that feels refreshing.",
    "sentiment": "POSITIVE"
},
{
    "title": "Klaus",
    "url": "https://www.rottentomatoes.com/m/klaus",
    "review": "Though there are some narrative blips in Klaus born out of a premise that is maybe just a little too complex for a 97-minute film, the movie is absolutely beautiful.",
    "sentiment": "POSITIVE"
},
{
    "title": "Klaus",
    "url": "https://www.rottentomatoes.com/m/klaus",
    "review": "A beautiful animation with a unique spin on the origin of many of our beloved Christmas traditions.",
    "sentiment": "POSITIVE"
},
{
    "title": "Klaus",
    "url": "https://www.rottentomatoes.com/m/klaus",
    "review": "The acts of kindness that [Klaus] talks about are just as important as everything else. I’ll surely make it a tradition to watch this film on Christmas Day.",
    "sentiment": "POSITIVE"
},
{
    "title": "Klaus",
    "url": "https://www.rottentomatoes.com/m/klaus",
    "review": "It has a splendid animation that serves as a background to rewrite the myth of Santa Claus with some nice characters that reach their most emotional point in their Christmas portrait of kindness and the value of selfless acts. [Full review in Spanish]",
    "sentiment": "POSITIVE"
},
{
    "title": "Christmas Eve in Miller's Point",
    "url": "https://www.rottentomatoes.com/m/christmas_eve_in_millers_point",
    "review": "There are cruising parallels with American contemporaries the Ross Brothers and Halina Reijn, but this daisy chain has an earnest, festive charm unlike any other. It’s a vibe.",
    "sentiment": "POSITIVE"
},
{
    "title": "Christmas Eve in Miller's Point",
    "url": "https://www.rottentomatoes.com/m/christmas_eve_in_millers_point",
    "review": "Essentially, this is like being in an annoying family reunion, but it's not your family... everything about the film is annoying.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Christmas Eve in Miller's Point",
    "url": "https://www.rottentomatoes.com/m/christmas_eve_in_millers_point",
    "review": "More ‘Lost In Long Island’ than ‘Miracle On Main Street’, this offbeat indie ladles on the melancholy mood while skimping on the holiday highs, and seems destined to become a cult Christmas favourite.",
    "sentiment": "POSITIVE"
},
{
    "title": "Christmas Eve in Miller's Point",
    "url": "https://www.rottentomatoes.com/m/christmas_eve_in_millers_point",
    "review": "Christmas Eve in Miller’s Point isn’t always easy to like, but it’s always easy to admire.",
    "sentiment": "POSITIVE"
},
{
    "title": "Christmas Eve in Miller's Point",
    "url": "https://www.rottentomatoes.com/m/christmas_eve_in_millers_point",
    "review": "The memory piece is nostalgic but not sentimental, undercut with a specter of settled regret.",
    "sentiment": "POSITIVE"
},
{
    "title": "Christmas Eve in Miller's Point",
    "url": "https://www.rottentomatoes.com/m/christmas_eve_in_millers_point",
    "review": "A movie that doesn't have a point with a story that's aimless drivel. It's nothing but a dull compilation of mindless drama and unfunny comedy scenes with forgettable characters during a Christmas Eve night on New York's Long Island.",
    "sentiment": "NEGATIVE"
},
{
    "title": "Joy",
    "url": "https://www.rottentomatoes.com/m/joy_2024",
    "review": "The historical details lend poignancy ... Purdy died from cancer at the age of 39, in 1985. She lived long enough to see hundreds of children born around the world via IVF. But not the many millions that followed.",
    "sentiment": "POSITIVE"
},
{
    "title": "Joy",
    "url": "https://www.rottentomatoes.com/m/joy_2024",
    "review": "Made with love, even in its awkward moments, this modest account of a miraculous achievement is quietly life-affirming.",
    "sentiment": "POSITIVE"
},
{
    "title": "Joy",
    "url": "https://www.rottentomatoes.com/m/joy_2024",
    "review": "A really inspirational film celebrating science, which sadly feels controversial now.",
    "sentiment": "POSITIVE"
},
{
    "title": "Joy",
    "url": "https://www.rottentomatoes.com/m/joy_2024",
    "review": "In the end, Joy acts as a well-worn lesson that even when women are the beating heart of the journey it still takes decades for our story to be told.",
    "sentiment": "POSITIVE"
},
{
    "title": "Joy",
    "url": "https://www.rottentomatoes.com/m/joy_2024",
    "review": "The interactions between Thomasin, Norton and Nighy prove invaluable, the three performers creating a natural, sincere rapport. Each are contrary to one another in some way or another, yet the balance they create ultimately proves complimentary.",
    "sentiment": "POSITIVE"
},
{
    "title": "Joy",
    "url": "https://www.rottentomatoes.com/m/joy_2024",
    "review": "... We won't spoil why this film, at times exciting, is titled Joy. [Full review in Spanish]",
    "sentiment": "POSITIVE"
},
{
    "title": "The Lion King",
    "url": "https://www.rottentomatoes.com/m/the_lion_king_2019",
    "review": "Watch this Lion King for the technical achievement and musical numbers, and then watch the original to feel satisfied.",
    "sentiment": "NEGATIVE"
},
{
    "title": "The Lion King",
    "url": "https://www.rottentomatoes.com/m/the_lion_king_2019",
    "review": "Overseeing such a massive technical production as this one requires a filmmaker to be on top of every nuance and detail in play. Actor/director Favreau is the right person for the job.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Lion King",
    "url": "https://www.rottentomatoes.com/m/the_lion_king_2019",
    "review": "The Lion King captures just enough of the original's warmhearted excitement -- and introduces enough new delights -- to feel like more than a cynical Disney money grab.",
    "sentiment": "NEGATIVE"
},
{
    "title": "The Lion King",
    "url": "https://www.rottentomatoes.com/m/the_lion_king_2019",
    "review": "Regarding this version, it does not contribute anything significant or new. Once again we find ourselves under the problem of current cinema, its lack of originality. In addition, the film has several technical and aesthetic problems.",
    "sentiment": "NEGATIVE"
},
{
    "title": "The Lion King",
    "url": "https://www.rottentomatoes.com/m/the_lion_king_2019",
    "review": "It doesn’t matter if the story is identical if we cry all the same. It doesn’t matter if we know what’s coming if we still feel nervous and worried about the characters. The Lion King is one of Disney’s best remakes so far, on par with The Jungle Book.",
    "sentiment": "POSITIVE"
},
{
    "title": "The Lion King",
    "url": "https://www.rottentomatoes.com/m/the_lion_king_2019",
    "review": "The Lion King 2019 is Disney at its worst, a soulless carbon copy of a vastly superior film that exists only to pander to nostalgia and reap financial benefit.",
    "sentiment": "NEGATIVE"
}
]
